arr_args_to_array=\u064A\u0639\u064A\u062F \u062C\u0645\u064A\u0639 \u0627\u0644\u0648\u0633\u0627\u0626\u0637 \u0627\u0644\u062A\u064A \u062A\u0645 \u062A\u0645\u0631\u064A\u0631\u0647\u0627 \u0625\u0644\u064A\u0647 \u0643\u0645\u0635\u0641\u0648\u0641\u0629
arr_in_array=\u064A\u0639\u0648\u062F \u0635\u062D\u064A\u062D\u064B\u0627 \u0625\u0630\u0627 \u0643\u0627\u0646\u062A \u0627\u0644\u0645\u0635\u0641\u0648\u0641\u0629 \u062A\u062D\u062A\u0648\u064A \u0639\u0644\u0649 \u0627\u0644\u0633\u0644\u0633\u0644\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629 \u060C \u0648\u0625\u0644\u0627 \u064A\u0639\u0648\u062F \u062E\u0637\u0623\u064B. \u0644\u0646 \u064A\u062A\u0645 \u062A\u062D\u0648\u064A\u0644 \u0623\u0646\u0648\u0627\u0639 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A.
arr_join=\u064A\u0642\u0648\u0645 \u0628\u0631\u0628\u0637 \u0627\u0644\u0639\u0646\u0627\u0635\u0631 \u0627\u0644\u0645\u0648\u062C\u0648\u062F\u0629 \u0641\u064A \u0627\u0644\u0645\u0635\u0641\u0648\u0641\u0629 \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 sep\u060C \u0648\u064A\u0639\u064A\u062F\u0647\u0627 \u0643\u0644\u0647\u0627 \u0643\u0633\u0644\u0633\u0644\u0629 .
arr_reverse=\u0639\u0643\u0633 \u0627\u0644\u0645\u0635\u0641\u0648\u0641\u0629 \u0623.
arr_uniques=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0645\u0635\u0641\u0648\u0641\u0629 \u0645\u0639 \u0625\u0632\u0627\u0644\u0629 \u0627\u0644\u062A\u0643\u0631\u0627\u0631\u0627\u062A. \u062D\u0633\u0627\u0633 \u0644\u062D\u0627\u0644\u0629 \u0627\u0644\u0623\u062D\u0631\u0641.
bool_and=\u064A\u0633\u062A\u062E\u062F\u0645 \u0627\u0644\u0639\u0627\u0645\u0644 \u0627\u0644\u0645\u0646\u0637\u0642\u064A AND \u0639\u0644\u0649 \u0642\u064A\u0645\u062A\u064A\u0646 \u0645\u0646\u0637\u0642\u064A\u062A\u064A\u0646 \u0623\u0648 \u0623\u0643\u062B\u0631 \u0644\u0625\u062E\u0631\u0627\u062C \u0642\u064A\u0645\u0629 \u0645\u0646\u0637\u0642\u064A\u0629 . \u064A\u0642\u064A\u0645 \u0639\u0628\u0627\u0631\u0627\u062A \u0645\u062A\u0639\u062F\u062F\u0629 \u0625\u0644\u0649 \u0642\u064A\u0645 \u0645\u0646\u0637\u0642\u064A\u0629\u060C \u062B\u0645 \u064A\u0639\u064A\u062F \u0627\u0644\u0642\u064A\u0645\u0629 true \u0625\u0630\u0627 \u0643\u0627\u0646\u062A \u062C\u0645\u064A\u0639 \u0627\u0644\u0639\u0628\u0627\u0631\u0627\u062A \u0635\u062D\u064A\u062D\u0629. \u0639\u0644\u0649 \u0633\u0628\u064A\u0644 \u0627\u0644\u0645\u062B\u0627\u0644\u060C (1 < 3).and(1 < 0) \u064A\u0639\u064A\u062F \u0627\u0644\u0642\u064A\u0645\u0629 false \u0644\u0623\u0646 \u0623\u062D\u062F \u0627\u0644\u0634\u0631\u0648\u0637 \u0635\u062D\u064A\u062D \u0648\u0627\u0644\u0622\u062E\u0631 \u062E\u0627\u0637\u0626.
bool_not=\u064A\u0633\u062A\u062E\u062F\u0645 \u0627\u0644\u0639\u0627\u0645\u0644 \u0627\u0644\u0645\u0646\u0637\u0642\u064A NOT \u0639\u0644\u0649 \u0642\u064A\u0645\u0629 \u0645\u0646\u0637\u0642\u064A\u0629 \u0644\u0625\u062E\u0631\u0627\u062C \u0642\u064A\u0645\u0629 \u0645\u0646\u0637\u0642\u064A\u0629 . \u0639\u0644\u0649 \u0633\u0628\u064A\u0644 \u0627\u0644\u0645\u062B\u0627\u0644\u060C not(1 > 7) \u064A\u0639\u064A\u062F \u0627\u0644\u0642\u064A\u0645\u0629 true \u0644\u0623\u0646 \u0627\u0644\u0642\u064A\u0645\u0629 1 > 7 \u0646\u0641\u0633\u0647\u0627 \u0647\u064A \u0642\u064A\u0645\u0629 false.
bool_xor=\u064A\u0633\u062A\u062E\u062F\u0645 \u0639\u0627\u0645\u0644 \u0627\u0644\u0645\u0646\u0637\u0642 XOR (exclusive-or) \u0639\u0644\u0649 \u0642\u064A\u0645\u062A\u064A\u0646 \u0645\u0646\u0637\u0642\u064A\u062A\u064A\u0646 \u0623\u0648 \u0623\u0643\u062B\u0631 \u0644\u0625\u062E\u0631\u0627\u062C \u0642\u064A\u0645\u0629 \u0645\u0646\u0637\u0642\u064A\u0629 . \u064A\u0642\u064A\u0645 \u0639\u0628\u0627\u0631\u0627\u062A \u0645\u062A\u0639\u062F\u062F\u0629 \u060C \u062B\u0645 \u064A\u0639\u064A\u062F \u0627\u0644\u0642\u064A\u0645\u0629 true \u0625\u0630\u0627 \u0643\u0627\u0646\u062A \u0648\u0627\u062D\u062F\u0629 \u0641\u0642\u0637 \u0645\u0646\u0647\u0627 \u0635\u062D\u064A\u062D\u0629. \u0639\u0644\u0649 \u0633\u0628\u064A\u0644 \u0627\u0644\u0645\u062B\u0627\u0644\u060C (1 < 3).xor(1 < 7) \u064A\u0639\u064A\u062F \u0627\u0644\u0642\u064A\u0645\u0629 false \u0644\u0623\u0646 \u0623\u0643\u062B\u0631 \u0645\u0646 \u0634\u0631\u0637 \u0648\u0627\u062D\u062F \u0635\u062D\u064A\u062D.
date_part=\u064A\u0639\u064A\u062F \u062C\u0632\u0621\u064B\u0627 \u0645\u0646 \u0627\u0644\u062A\u0627\u0631\u064A\u062E. \u064A\u0639\u062A\u0645\u062F \u0646\u0648\u0639 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0645\u064F\u0631\u062C\u0639\u0629 \u0639\u0644\u0649 \u0627\u0644\u0648\u062D\u062F\u0629. \u0631\u0627\u062C\u0639 https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit\u060C https://openrefine.org/docs/manual/grelfunctions#date-functions \u0644\u0644\u062D\u0635\u0648\u0644 \u0639\u0644\u0649 \u062C\u062F\u0648\u0644.
date_now=\u064A\u0639\u064A\u062F \u0627\u0644\u0648\u0642\u062A \u0627\u0644\u062D\u0627\u0644\u064A \u0648\u0641\u0642\u064B\u0627 \u0644\u0633\u0627\u0639\u0629 \u0627\u0644\u0646\u0638\u0627\u0645 \u0644\u062F\u064A\u0643\u060C \u0628\u062A\u0646\u0633\u064A\u0642 ISO 8601 \u0627\u0644\u0645\u0648\u0633\u0639 (\u0645\u062D\u0648\u0651\u0644 \u0625\u0644\u0649 UTC). \u0639\u0644\u0649 \u0633\u0628\u064A\u0644 \u0627\u0644\u0645\u062B\u0627\u0644\u060C \u0627\u0644\u0633\u0627\u0639\u0629 10:53 \u0635\u0628\u0627\u062D\u064B\u0627 (\u064800 \u062B\u0627\u0646\u064A\u0629) \u0641\u064A 26 \u0646\u0648\u0641\u0645\u0628\u0631 2020 \u0628\u062A\u0648\u0642\u064A\u062A \u0634\u0631\u0642 \u0627\u0644\u0648\u0644\u0627\u064A\u0627\u062A \u0627\u0644\u0645\u062A\u062D\u062F\u0629 \u062A\u0639\u064A\u062F [\u0627\u0644\u062A\u0627\u0631\u064A\u062E 2020-11-26T15:53:00Z].
math_abs=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0645\u0637\u0644\u0642\u0629 \u0644\u0631\u0642\u0645.
math_acos=\u0625\u0631\u062C\u0627\u0639 \u062C\u064A\u0628 \u0627\u0644\u062A\u0645\u0627\u0645 \u0627\u0644\u0642\u0648\u0633\u064A \u0644\u0644\u0632\u0627\u0648\u064A\u0629\u060C \u0641\u064A \u0627\u0644\u0646\u0637\u0627\u0642 \u0645\u0646 0 \u0625\u0644\u0649 PI.
math_asin=\u0625\u0631\u062C\u0627\u0639 \u062C\u064A\u0628 \u0627\u0644\u0642\u0648\u0633 \u0644\u0644\u0632\u0627\u0648\u064A\u0629 \u0641\u064A \u0627\u0644\u0646\u0637\u0627\u0642 \u0645\u0646 -PI/2 \u0625\u0644\u0649 PI/2.
math_atan=\u0625\u0631\u062C\u0627\u0639 \u0638\u0644 \u0627\u0644\u0642\u0648\u0633 \u0644\u0644\u0632\u0627\u0648\u064A\u0629 \u0641\u064A \u0627\u0644\u0646\u0637\u0627\u0642 \u0645\u0646 -PI/2 \u0625\u0644\u0649 PI/2.
math_atan2=\u064A\u062D\u0648\u0644 \u0627\u0644\u0625\u062D\u062F\u0627\u062B\u064A\u0627\u062A \u0627\u0644\u0645\u0633\u062A\u0637\u064A\u0644\u0629 (n1\u060C n2) \u0625\u0644\u0649 \u0625\u062D\u062F\u0627\u062B\u064A\u0627\u062A \u0642\u0637\u0628\u064A\u0629 (r\u060C theta). \u064A\u0639\u064A\u062F \u0627\u0644\u0631\u0642\u0645 theta.
math_ceil=\u0625\u0631\u062C\u0627\u0639 \u0633\u0642\u0641 \u0627\u0644\u0631\u0642\u0645.
math_combin=\u0625\u0631\u062C\u0627\u0639 \u0639\u062F\u062F \u0627\u0644\u062A\u0631\u0643\u064A\u0628\u0627\u062A \u0644\u0639\u0646\u0627\u0635\u0631 n2 \u0643\u0645\u0627 \u062A\u0645 \u062A\u0642\u0633\u064A\u0645\u0647\u0627 \u0639\u0644\u0649 n1.
math_cos=\u0625\u0631\u062C\u0627\u0639 \u062C\u064A\u0628 \u0627\u0644\u062A\u0645\u0627\u0645 \u0627\u0644\u0645\u062B\u0644\u062B\u064A \u0644\u0644\u0632\u0627\u0648\u064A\u0629.
math_cosh=\u0625\u0631\u062C\u0627\u0639 \u062C\u064A\u0628 \u0627\u0644\u062A\u0645\u0627\u0645 \u0627\u0644\u0632\u0627\u0626\u062F\u064A \u0644\u0642\u064A\u0645\u0629 .
math_degrees=\u062A\u062D\u0648\u064A\u0644 \u0627\u0644\u0632\u0627\u0648\u064A\u0629 \u0645\u0646 \u0627\u0644\u0631\u0627\u062F\u064A\u0627\u0646 \u0625\u0644\u0649 \u0644\u062F\u0631\u062C\u0627\u062A.
math_even=\u062A\u0642\u0631\u064A\u0628 \u0627\u0644\u0631\u0642\u0645 \u0625\u0644\u0649 \u0623\u0642\u0631\u0628 \u0639\u062F\u062F \u0635\u062D\u064A\u062D \u0632\u0648\u062C\u064A.
math_exp=\u064A\u0639\u0648\u062F e \u0625\u0644\u0649 \u0642\u0648\u0629 n.
math_fact=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0639\u0627\u0645\u0644\u064A \u0644\u0644\u0631\u0642\u0645\u060C \u0628\u062F\u0621\u064B\u0627 \u0645\u0646 1.
math_factn=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0639\u0627\u0645\u0644\u064A \u0644\u0640 n1\u060C \u0628\u062F\u0621\u064B\u0627 \u0645\u0646 n2.
math_floor=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u062D\u062F \u0627\u0644\u0623\u062F\u0646\u0649 \u0644\u0644\u0631\u0642\u0645.
math_gcd=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0642\u0627\u0633\u0645 \u0627\u0644\u0645\u0634\u062A\u0631\u0643 \u0627\u0644\u0623\u0643\u0628\u0631 \u0628\u064A\u0646 \u0631\u0642\u0645\u064A\u0646.
math_lcm=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0645\u0636\u0627\u0639\u0641 \u0627\u0644\u0645\u0634\u062A\u0631\u0643 \u0627\u0644\u0623\u0635\u063A\u0631 \u0644\u0631\u0642\u0645\u064A\u0646.
math_ln=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0644\u0648\u063A\u0627\u0631\u064A\u062A\u0645 \u0627\u0644\u0637\u0628\u064A\u0639\u064A \u0644\u0640 n.
math_log=\u0625\u0631\u062C\u0627\u0639 \u0627\u0644\u0644\u0648\u063A\u0627\u0631\u064A\u062A\u0645 \u0627\u0644\u0623\u0633\u0627\u0633\u064A 10 \u0644\u0640 n.
date_inc=\u064A\u0639\u064A\u062F \u062A\u0627\u0631\u064A\u062E\u064B\u0627 \u062A\u0645 \u062A\u063A\u064A\u064A\u0631\u0647 \u0628\u0645\u0642\u062F\u0627\u0631 \u0645\u0639\u064A\u0646 \u0641\u064A \u0648\u062D\u062F\u0629 \u0632\u0645\u0646\u064A\u0629 \u0645\u0639\u064A\u0646\u0629\u060C \u0628\u064A\u0646 \u0639\u0644\u0627\u0645\u062A\u064A \u0627\u0642\u062A\u0628\u0627\u0633. \u0631\u0627\u062C\u0639 https://openrefine.org/docs/manual/grelfunctions/#incd-ns-timeunit \u0644\u0644\u062D\u0635\u0648\u0644 \u0639\u0644\u0649 \u062C\u062F\u0648\u0644. \u0627\u0644\u0648\u062D\u062F\u0629 \u0627\u0644\u0627\u0641\u062A\u0631\u0627\u0636\u064A\u0629 \u0647\u064A ''hour''. \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0645\u0648\u062C\u0628\u0629 \u062A\u0632\u064A\u062F \u0645\u0646 \u0627\u0644\u062A\u0627\u0631\u064A\u062E\u060C \u0648\u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0633\u0627\u0644\u0628\u0629 \u062A\u0639\u064A\u062F\u0647 \u0625\u0644\u0649 \u0627\u0644\u0648\u0631\u0627\u0621 \u0641\u064A \u0627\u0644\u0648\u0642\u062A.
arr_sort=\u064A\u062A\u0645 \u0641\u0631\u0632 \u0627\u0644\u0645\u0635\u0641\u0648\u0641\u0629 \u0628\u062A\u0631\u062A\u064A\u0628 \u062A\u0635\u0627\u0639\u062F\u064A. \u0627\u0644\u0641\u0631\u0632 \u062D\u0633\u0627\u0633 \u0644\u062D\u0627\u0644\u0629 \u0627\u0644\u0623\u062D\u0631\u0641\u060C \u062D\u064A\u062B \u062A\u0628\u062F\u0623 \u0627\u0644\u0623\u062D\u0631\u0641 \u0627\u0644\u0643\u0628\u064A\u0631\u0629 \u0623\u0648\u0644\u0627\u064B \u062B\u0645 \u0627\u0644\u0623\u062D\u0631\u0641 \u0627\u0644\u0635\u063A\u064A\u0631\u0629 \u062B\u0627\u0646\u064A\u0627\u064B.
html_inner_html=\u064A\u0639\u064A\u062F HTML \u0627\u0644\u062F\u0627\u062E\u0644\u064A \u0644\u0639\u0646\u0635\u0631 HTML. \u0633\u064A\u062A\u0636\u0645\u0646 \u0647\u0630\u0627 \u0646\u0635\u064B\u0627 \u0648\u0639\u0646\u0627\u0635\u0631 \u0641\u0631\u0639\u064A\u0629 \u062F\u0627\u062E\u0644 \u0627\u0644\u0639\u0646\u0635\u0631 \u0627\u0644\u0645\u062D\u062F\u062F. \u0627\u0633\u062A\u062E\u062F\u0645\u0647 \u0628\u0627\u0644\u062A\u0632\u0627\u0645\u0646 \u0645\u0639 parseHtml() \u0648select() \u0644\u062A\u0648\u0641\u064A\u0631 \u0639\u0646\u0635\u0631.
html_parse_html=\u0625\u0630\u0627 \u0643\u0627\u0646\u062A \u0627\u0644\u062E\u0644\u064A\u0629 \u0645\u0644\u064A\u0626\u0629 \u0628\u0646\u0635 \u0628\u062A\u0646\u0633\u064A\u0642 HTML\u060C \u0641\u0625\u0646 parseHtml() \u064A\u0628\u0633\u0637 \u0639\u0644\u0627\u0645\u0627\u062A HTML (\u0645\u062B\u0644 \u0625\u0632\u0627\u0644\u0629 '' /'' \u0641\u064A \u0646\u0647\u0627\u064A\u0629 \u0627\u0644\u0639\u0644\u0627\u0645\u0627\u062A \u0627\u0644\u062A\u064A \u062A\u063A\u0644\u0642 \u0646\u0641\u0633\u0647\u0627)\u060C \u0648\u064A\u063A\u0644\u0642 \u0623\u064A \u0639\u0644\u0627\u0645\u0627\u062A \u063A\u064A\u0631 \u0645\u063A\u0644\u0642\u0629\u060C \u0648\u064A\u062F\u0631\u062C \u0641\u0648\u0627\u0635\u0644 \u0627\u0644\u0623\u0633\u0637\u0631 \u0648\u0627\u0644\u0645\u0633\u0627\u0641\u0627\u062A \u0627\u0644\u0628\u0627\u062F\u0626\u0629 \u0644\u0644\u062D\u0635\u0648\u0644 \u0639\u0644\u0649 \u0643\u0648\u062F \u0623\u0646\u0638\u0641. \u0644\u0627 \u064A\u0645\u0643\u0646 \u0644\u0644\u062E\u0644\u064A\u0629 \u062A\u062E\u0632\u064A\u0646 \u0645\u062E\u0631\u062C\u0627\u062A parseHtml() \u0645\u0627 \u0644\u0645 \u062A\u062D\u0648\u0644\u0647\u0627 \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 toString(): \u0639\u0644\u0649 \u0633\u0628\u064A\u0644 \u0627\u0644\u0645\u062B\u0627\u0644\u060C \u0627\u0644\u0642\u064A\u0645\u0629 .parseHtml().toString()
arr_zip=\u062F\u0645\u062C \u0645\u0635\u0641\u0648\u0641\u062A\u064A\u0646 \u0623\u0648 \u0623\u0643\u062B\u0631 \u0641\u064A \u0645\u0635\u0641\u0648\u0641\u0629 \u0648\u0627\u062D\u062F\u0629 \u0645\u0646 \u0627\u0644\u0645\u0635\u0641\u0648\u0641\u0627\u062A\u060C \u062D\u064A\u062B \u064A\u062A\u0645 \u062A\u062C\u0645\u064A\u0639 \u0627\u0644\u0639\u0646\u0627\u0635\u0631 \u0627\u0644\u0645\u0648\u062C\u0648\u062F\u0629 \u0628\u0646\u0641\u0633 \u0627\u0644\u0641\u0647\u0631\u0633 \u0645\u0646 \u0645\u0635\u0641\u0648\u0641\u0627\u062A \u0627\u0644\u0625\u062F\u062E\u0627\u0644 \u0645\u0639\u064B\u0627 \u0644\u062A\u0634\u0643\u064A\u0644 \u0645\u0635\u0641\u0648\u0641\u0629 \u0641\u0631\u0639\u064A\u0629 \u0641\u064A \u0645\u0635\u0641\u0648\u0641\u0629 \u0627\u0644\u0625\u062E\u0631\u0627\u062C.
bool_or=\u064A\u0633\u062A\u062E\u062F\u0645 \u0627\u0644\u0639\u0627\u0645\u0644 \u0627\u0644\u0645\u0646\u0637\u0642\u064A OR \u0639\u0644\u0649 \u0642\u064A\u0645\u062A\u064A\u0646 \u0645\u0646\u0637\u0642\u064A\u062A\u064A\u0646 \u0623\u0648 \u0623\u0643\u062B\u0631 \u0644\u0625\u062E\u0631\u0627\u062C \u0642\u064A\u0645\u0629 \u0645\u0646\u0637\u0642\u064A\u0629 . \u0639\u0644\u0649 \u0633\u0628\u064A\u0644 \u0627\u0644\u0645\u062B\u0627\u0644\u060C (1 < 3).or(1 > 7) \u062A\u0631\u062C\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 true \u0644\u0623\u0646 \u0623\u062D\u062F \u0627\u0644\u0634\u0631\u0648\u0637 \u0639\u0644\u0649 \u0627\u0644\u0623\u0642\u0644 (\u0627\u0644\u0634\u0631\u0637 \u0627\u0644\u0623\u0648\u0644) \u0635\u062D\u064A\u062D.
