math_ln=Renvoie le logarithme naturel de n.
math_log=Renvoie le logarithme en base 10 de n.
math_max=Renvoie le plus grand de deux nombres.
math_min=Renvoie le plus petit de deux nombres.
date_now=Renvoie l'heure actuelle de l'horloge de votre syst\u00E8me, dans le format \u00E9tendu ISO 8601 (converti en UTC). Par exemple, 10:53am (et 00 secondes) le 26 novembre 2020 en EST renvoie [date 2020-11-26T15:53:00Z].
math_abs=Renvoie la valeur absolue d'un nombre.
math_acos=Renvoie l'arc cosinus d'un angle, entre 0 et pi.
math_atan=Renvoie l'arc tangent d'un angle compris entre -pi/2 et pi/2.
math_atan2=Convertir des coordonn\u00E9es rectangulaires (n1, n2) en coordonn\u00E9es polaires (r, theta). Renvoie le nombre th\u00EAta.
math_combin=Renvoie le nombre de combinaisons pour n2 \u00E9l\u00E9ments divis\u00E9s en n1.
math_cos=Renvoie le cosinus trigonom\u00E9trique d'un angle.
math_cosh=Renvoie le cosinus hyperbolique d'une valeur.
math_ceil=Renvoie la partie enti\u00E8re sup\u00E9rieure d'un nombre.
math_degrees=Convertit un angle de radians en degr\u00E9s.
math_exp=Renvoie e \u00E0 la puissance de n.
math_fact=Renvoie la factorielle d'un nombre, \u00E0 partir de 1.
math_floor=Renvoie la part enti\u00E8re inf\u00E9rieure d'un nombre.
math_gcd=Renvoie le plus grand d\u00E9nominateur commun de deux nombres.
math_lcm=Renvoie le plus grand d\u00E9nominateur commun de deux nombres.
math_odd=Arrondit le nombre \u00E0 l'entier impair le plus proche.
math_pow=Renvoie n1 \u00E9lev\u00E9 \u00E0 la puissance de n2.
math_round=Arrondit un nombre \u00E0 l'entier le plus proche.
math_sin=Renvoie le sinus trigonom\u00E9trique d'un angle.
math_radians=Convertit un angle en degr\u00E9s en radians.
math_tan=Renvoie la tangente trigonom\u00E9trique d'un angle.
math_tanh=Renvoie la tangente hyperbolique d'un angle.
str_phonetic=Renvoie un encodage phon\u00E9tique d'une cha\u00EEne de caract\u00E8res, bas\u00E9 sur un algorithme phon\u00E9tique disponible. Il peut s'agir de l'une des m\u00E9thodes phon\u00E9tiques suivantes\u00A0: metaphone, doublemetaphone, metaphone3, soundex, cologne. La valeur par d\u00E9faut est ''metaphone3''.
math_even=Retourne un nombre arrondi \u00E0 l'entier pair le plus proche.
math_factn=Renvoie la factorielle de n1, \u00E0 partir de n2.
math_asin=Renvoie l'arc sinus d'un angle compris entre -pi/2 et pi/2.
date_inc=Renvoie une date modifi\u00E9e par le nombre donn\u00E9 dans l'unit\u00E9 de temps donn\u00E9e, entre guillemets. Voir https://openrefine.org/docs/manual/grelfunctions/#incd-n-s-timeunit pour un tableau. L'unit\u00E9 par d\u00E9faut est l'heure. Une valeur positive augmente la date, et une valeur n\u00E9gative la fait reculer dans le temps.
date_part=Renvoie une partie de la date. Le type de donn\u00E9es renvoy\u00E9es d\u00E9pend de l'unit\u00E9. Voir https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit, https://openrefine.org/docs/manual/grelfunctions#date-functions pour un tableau.
html_inner_html=Renvoie le code HTML interne d'un \u00E9l\u00E9ment HTML. Cela inclut le texte et les \u00E9l\u00E9ments enfants de l'\u00E9l\u00E9ment s\u00E9lectionn\u00E9. \u00C0 utiliser en compl\u00E9ment de parseHtml() et select() pour fournir un \u00E9l\u00E9ment.
bool_xor=Utilise l'op\u00E9rateur logique XOR (OU exclusif) sur deux bool\u00E9ens ou plus et renvoie un bool\u00E9en. \u00C9value plusieurs d\u00E9clarations, puis renvoie un r\u00E9sultat positif si une seule d'entre elles est vraie. Par exemple, (1 < 3).xor(1 < 7) renvoie un r\u00E9sultat faux car plus d'une des conditions est vraie.
html_parse_html=Dans une cellule remplie de texte au format HTML, parseHtml() simplifie les balises HTML (par exemple en supprimant les '' /'' \u00E0 la fin des balises auto-fermantes), ferme toutes les balises non ferm\u00E9es et ins\u00E8re des sauts de ligne et des retraits pour un code plus propre. Une cellule ne peut pas stocker la sortie de parseHtml() \u00E0 moins que vous ne la convertissiez avec toString()\u00A0: par exemple, value.parseHtml().toString().
math_random_number=Renvoie un nombre entier al\u00E9atoire dans l'intervalle entre les bornes inf\u00E9rieure et sup\u00E9rieure (inclusivement). Un nombre al\u00E9atoire diff\u00E9rent sera g\u00E9n\u00E9r\u00E9 dans chaque cellule d'une colonne.
math_sinh=Renvoie le sinus hyperbolique d'un angle.
math_sum=Renvoie la somme des nombres contenus dans le tableau. Ne tient pas compte des \u00E9l\u00E9ments qui ne sont pas des nombres. Renvoie 0 si le tableau ne contient pas de nombre.
math_quotient=Renvoie la partie enti\u00E8re d'une division (tronqu\u00E9e, non arrondie), lorsqu'elle est fournie avec un num\u00E9rateur et un d\u00E9nominateur.
arr_reverse=Inverse le tableau a.
arr_sort=Trie le tableau par ordre croissant. Le tri est sensible \u00E0 la casse, les majuscules en premier et les minuscules en second.
bool_or=Utilise l'op\u00E9rateur logique OU sur deux bool\u00E9ens ou plus et renvoie un bool\u00E9en. Par exemple, (1 < 3).or(1 > 7) revoie vrai car au moins une de deux conditions (la premi\u00E8re) est vraie.
bool_not=Utilise l'op\u00E9rateur logique NOT sur un bool\u00E9en et renvoie un bool\u00E9en. Par exemple, not(1 > 7) renvoie vrai car 1 > 7 est faux.
math_mod=Renvoie n1 modulo n2.
math_multinomial=Calcule la multinomiale d'un nombre ou d'une s\u00E9rie de nombres.
str_chomp=Renvoie une copie de la cha\u00EEne s avec la cha\u00EEne sep retir\u00E9e de la fin si s se termine par sep\u202F; renvoie s sinon.
str_contains=Renvoie un bool\u00E9en indiquant si s contient sub, qui est soit une sous-cha\u00EEne, soit une expression r\u00E9guli\u00E8re. Par exemple, "food".contains("oo") renvoie vrai.
arr_join=Joint les \u00E9l\u00E9ments du tableau avec sep et renvoie le tout dans une cha\u00EEne.
arr_zip=Combines deux tableaux ou plus dans un seul tableau de tableaux, o\u00F9 les \u00E9l\u00E9ments ayant le m\u00EAme index dans les tableaux d'entr\u00E9e sont regroup\u00E9s pour former un sous-tableau dans le tableau de sortie.
arr_uniques=Renvoie le tableau avec les doublons retir\u00E9s. Sensible \u00E0 la casse.
arr_args_to_array=Renvoie tout les arguments pass\u00E9s dans un tableau
bool_and=Utilise l'op\u00E9rateur logique ET sur deux bool\u00E9ens ou plus pour produire un bool\u00E9en. \u00C9value plusieurs d\u00E9clarations en bool\u00E9ens, puis renvoie vrai si tous les d\u00E9clarations sont vraies. Par exemple, (1 < 3).and(1 < 0) renvoie faux car l'une des conditions est vraie et l'autre est fausse.
arr_in_array=Renvoie vrai si le tableau contient la cha\u00EEne souhait\u00E9e et faux sinon. Ne convertit pas les types de donn\u00E9es.
str_detect_language=D\u00E9termine la langue de la cha\u00EEne donn\u00E9e et renvoie le code de la langue.
str_decode=D\u00E9code une cha\u00EEne \u00E0 l'aide de l'encodage sp\u00E9cifi\u00E9. Les encodages sont Base16, Base32Hex, Base32, Base64 et Base64Url.
str_ends_with=Renvoie un bool\u00E9en indiquant si s se termine par sub. Par exemple, "food".endsWith("ood") renvoie un r\u00E9sultat positif, tandis que "food".endsWith("odd") renvoie un r\u00E9sultat n\u00E9gatif.
str_last_index_of=Renvoie l'index du premier caract\u00E8re de sub tel qu'il appara\u00EEt pour la derni\u00E8re fois dans s\u202F; ou renvoie -1 si s ne contient pas de sub. Par exemple, "parallel".lastIndexOf("a") renvoie 3 (indiquant le deuxi\u00E8me "a").
str_md5=Renvoie le hachage MD5 d'un objet. Si on lui fournit quelque chose d'autre qu'une cha\u00EEne (tableau, nombre, date, etc.), md5() le convertira en cha\u00EEne et fournira le hachage de la cha\u00EEne.
str_parse_uri=Analyser un URI et extraire ses composants.
str_replace_chars=Renvoie la cha\u00EEne obtenue en rempla\u00E7ant un caract\u00E8re de s, identifi\u00E9 par find, par le caract\u00E8re correspondant identifi\u00E9 par replace. Vous ne pouvez pas utiliser cette fonction pour remplacer un seul caract\u00E8re par plusieurs caract\u00E8res.
str_replace_each=Remplace chaque occurrence d'une sous-cha\u00EEne dans une cha\u00EEne par une autre sous-cha\u00EEne.
str_split_by_char_type=Renvoie un tableau de cha\u00EEnes de caract\u00E8res obtenues en divisant s en groupes de caract\u00E8res cons\u00E9cutifs chaque fois que les caract\u00E8res changent de cat\u00E9gorie Unicode.
str_starts_with=Renvoie un bool\u00E9en indiquant si s commence par sub. Par exemple, "food".startsWith("foo") renvoie vrai, tandis que "food".startsWith("bar") renvoie faux.
fun_to_number=Renvoie une cha\u00EEne de caract\u00E8res convertie en nombre. Tente de convertir d'autres formats en cha\u00EEne de caract\u00E8res, puis en nombre. Si la valeur est d\u00E9j\u00E0 un nombre, il renvoie le nombre.
fun_type=Renvoie une cha\u00EEne avec le type de donn\u00E9es o, comme undefined, string, number, boolean, etc.
str_split_by_lengths=Renvoie le tableau de cha\u00EEnes obtenu en divisant s en sous-cha\u00EEnes ayant les longueurs donn\u00E9es. Par exemple, "internationalization".splitByLengths(5, 6, 3) renvoie un tableau de 3 cha\u00EEnes\u00A0: ["inter", "nation", "ali" ]. Les caract\u00E8res exc\u00E9dentaires sont \u00E9limin\u00E9s du tableau de sortie.
str_range=Renvoie un tableau o\u00F9 a et b sont respectivement le d\u00E9but et la fin de la plage et c est le pas (incr\u00E9ment).
str_reinterpret=Renvoie s r\u00E9interpr\u00E9t\u00E9 \u00E0 travers les codeurs de caract\u00E8res donn\u00E9s. Vous devez fournir l'un des encodages support\u00E9s pour la source originale et la sortie cible\u00A0: https://docs.oracle.com/javase/1.5.0/docs/guide/intl/encoding.doc.html. Notez que les guillemets sont n\u00E9cessaires autour des codeurs de caract\u00E8res.
str_unicode=Renvoie un tableau de cha\u00EEnes de caract\u00E8res d\u00E9crivant chaque caract\u00E8re de s dans sa notation unicode compl\u00E8te.
str_to_title_case=Retourne la cha\u00EEne s convertie en initiales majuscules\u00A0: une lettre majuscule commen\u00E7ant chaque mot, et le reste des lettres en minuscules. Par exemple, ''Il \u00E9tait une fois minuit TR\u00C9MAIRE''.toTitlecase() renvoie la cha\u00EEne ''Il \u00E9tait une fois minuit TR\u00C9MAIRE''. Optionnellement, une cha\u00EEne de caract\u00E8res de d\u00E9limitation utilis\u00E9e pour s\u00E9parer les mots. Le premier caract\u00E8re et le premier caract\u00E8re non d\u00E9limiteur apr\u00E8s un d\u00E9limiteur seront mis en majuscules. Par exemple, "jean-michel jarre".toTitlecase(" - ") renvoie "Jean-Michel Jarre".
str_diff=La fonction compare deux cha\u00EEnes de caract\u00E8res et renvoie une cha\u00EEne. Renvoie le reste de o2 en commen\u00E7ant par le premier caract\u00E8re o\u00F9 elles diff\u00E8rent. Pour les dates, renvoie la diff\u00E9rence en unit\u00E9s de temps donn\u00E9es. Voir le tableau des unit\u00E9s de temps \u00E0 l'adresse https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit.
str_smart_split=Renvoie le tableau de cha\u00EEnes de caract\u00E8res obtenu en divisant s par sep, ou en supposant une s\u00E9paration par tabulation ou virgule si sep n'est pas donn\u00E9. G\u00E8re correctement les guillemets et comprend les caract\u00E8res annul\u00E9s. Le s\u00E9parateur peut \u00EAtre une cha\u00EEne de caract\u00E8res ou une expression r\u00E9guli\u00E8re.
str_trim=Renvoie une copie de la cha\u00EEne de caract\u00E8res s en supprimant les espaces blancs de d\u00E9but et de fin.
str_sha1=Renvoie le hachage SHA-1 d'un objet. Si on lui fournit autre chose qu'une cha\u00EEne (tableau, nombre, date, etc.), sha1() la convertira en cha\u00EEne et fournira le hachage de la cha\u00EEne.
str_unicode_type=Renvoie un tableau de cha\u00EEnes de caract\u00E8res d\u00E9crivant chaque caract\u00E8re de s par leur type unicode.
str_split=Renvoie le tableau de cha\u00EEnes de caract\u00E8res obtenu en divisant s par sep. Le s\u00E9parateur peut \u00EAtre une cha\u00EEne de caract\u00E8res ou un mod\u00E8le d'expression r\u00E9guli\u00E8re. Si preserveTokens est vrai, les segments vides sont pr\u00E9serv\u00E9s.
str_to_lowercase=Renvoie la cha\u00EEne s convertie en minuscules.
str_to_uppercase=Renvoie la cha\u00EEne de caract\u00E8res s convertie en majuscules.
str_encode=Encode une cha\u00EEne de caract\u00E8res \u00E0 l'aide de l'encodage sp\u00E9cifi\u00E9. Les encodages comprennent Base16, Base32Hex, Base32, Base64 et Base64Url.
fun_jsonize=Cite une valeur en tant que valeur litt\u00E9rale JSON.
fun_to_string=Prend n'importe quel type de valeur (cha\u00EEne, nombre, date, bool\u00E9en, erreur, null) et donne une version cha\u00EEne de cette valeur. Vous pouvez convertir des nombres en cha\u00EEnes avec arrondi, en utilisant un format de cha\u00EEne optionnel. Voir https://docs.oracle.com/javase/8/docs/api/java/util/Formatter.html. Vous pouvez \u00E9galement convertir des dates en cha\u00EEnes en utilisant la syntaxe d'analyse des dates. Voir https://openrefine.org/docs/manual/grelfunctions/#date-functions.
fun_length=Renvoie la longueur de la cha\u00EEne s sous forme de nombre, ou la taille du tableau a, c'est-\u00E0-dire le nombre d'objets qu'il contient. Les tableaux peuvent \u00EAtre vides, auquel cas length() renverra 0.
fun_time_since_unix_epoch_to_date=Renvoie un nombre converti en date sur la base de l'heure Epoch Unix. Le nombre peut \u00EAtre le temps Epoch Unix dans l'une des unit\u00E9s suivantes\u00A0: seconde, milliseconde, microseconde. La valeur par d\u00E9faut est ''seconde''.
fun_to_date=Renvoie l'objet d'entr\u00E9e converti en objet date. Sans arguments, il renvoie le format \u00E9tendu ISO 8601. Avec des arguments, vous pouvez contr\u00F4ler le format de sortie. monthFirst\u00A0: faux si la date est format\u00E9e avec le jour avant le mois. formatN\u00A0: tente d'analyser la date \u00E0 l'aide d'une liste ordonn\u00E9e de formats possibles. Fournit des formats bas\u00E9s sur la syntaxe de SimpleDateFormat\u00A0: <a href="http://docs.oracle.com/javase/7/docs/api/java/text/SimpleDateFormat.html">SimpleDateFormat</a>.
str_match=Tente de faire correspondre la cha\u00EEne s dans son int\u00E9gralit\u00E9 au motif d'expression r\u00E9guli\u00E8re p et, si le motif est trouv\u00E9, produit un tableau de tous les groupes de capture (trouv\u00E9s dans l'ordre). Voir aussi find().
