math_ln=Renvoie le logarithme naturel de n.
math_log=Renvoie le logarithme en base 10 de n.
math_max=Renvoie le plus grand de deux nombres.
math_min=Renvoie le plus petit de deux nombres.
date_now=Renvoie l'heure actuelle de l'horloge de votre syst\u00E8me, dans le format \u00E9tendu ISO 8601 (converti en UTC). Par exemple, 10:53am (et 00 secondes) le 26 novembre 2020 en EST renvoie [date 2020-11-26T15:53:00Z].
math_abs=Renvoie la valeur absolue d'un nombre.
math_acos=Renvoie l'arc cosinus d'un angle, entre 0 et pi.
math_atan=Renvoie l'arc tangent d'un angle compris entre -pi/2 et pi/2.
math_atan2=Convertir des coordonn\u00E9es rectangulaires (n1, n2) en coordonn\u00E9es polaires (r, theta). Renvoie le nombre th\u00EAta.
math_combin=Renvoie le nombre de combinaisons pour n2 \u00E9l\u00E9ments divis\u00E9s en n1.
math_cos=Renvoie le cosinus trigonom\u00E9trique d'un angle.
math_cosh=Renvoie le cosinus hyperbolique d'une valeur.
math_ceil=Renvoie la partie enti\u00E8re sup\u00E9rieure d'un nombre.
math_degrees=Convertit un angle de radians en degr\u00E9s.
math_exp=Renvoie e \u00E0 la puissance de n.
math_fact=Renvoie la factorielle d'un nombre, \u00E0 partir de 1.
math_floor=Renvoie la part enti\u00E8re inf\u00E9rieure d'un nombre.
math_gcd=Renvoie le plus grand d\u00E9nominateur commun de deux nombres.
math_lcm=Renvoie le plus grand d\u00E9nominateur commun de deux nombres.
math_odd=Arrondit le nombre \u00E0 l'entier impair le plus proche.
math_pow=Renvoie n1 \u00E9lev\u00E9 \u00E0 la puissance de n2.
math_round=Arrondit un nombre \u00E0 l'entier le plus proche.
math_sin=Renvoie le sinus trigonom\u00E9trique d'un angle.
math_radians=Convertit un angle en degr\u00E9s en radians.
math_tan=Renvoie la tangente trigonom\u00E9trique d'un angle.
math_tanh=Renvoie la tangente hyperbolique d'un angle.
str_phonetic=Renvoie un encodage phon\u00E9tique d'une cha\u00EEne de caract\u00E8res, bas\u00E9 sur un algorithme phon\u00E9tique disponible. Il peut s'agir de l'une des m\u00E9thodes phon\u00E9tiques suivantes\u00A0: metaphone, doublemetaphone, metaphone3, soundex, cologne. La valeur par d\u00E9faut est ''metaphone3''.
math_even=Retourne un nombre arrondi \u00E0 l'entier pair le plus proche.
math_factn=Renvoie la factorielle de n1, \u00E0 partir de n2.
math_asin=Renvoie l'arc sinus d'un angle compris entre -pi/2 et pi/2.
date_inc=Renvoie une date modifi\u00E9e par le nombre donn\u00E9 dans l'unit\u00E9 de temps donn\u00E9e, entre guillemets. Voir https://openrefine.org/docs/manual/grelfunctions/#incd-n-s-timeunit pour un tableau. L'unit\u00E9 par d\u00E9faut est l'heure. Une valeur positive augmente la date, et une valeur n\u00E9gative la fait reculer dans le temps.
date_part=Renvoie une partie de la date. Le type de donn\u00E9es renvoy\u00E9es d\u00E9pend de l'unit\u00E9. Voir https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit, https://openrefine.org/docs/manual/grelfunctions#date-functions pour un tableau.
html_inner_html=Renvoie le code HTML interne d'un \u00E9l\u00E9ment HTML. Cela inclut le texte et les \u00E9l\u00E9ments enfants de l'\u00E9l\u00E9ment s\u00E9lectionn\u00E9. \u00C0 utiliser en compl\u00E9ment de parseHtml() et select() pour fournir un \u00E9l\u00E9ment.
bool_xor=Utilise l'op\u00E9rateur logique XOR (OU exclusif) sur deux bool\u00E9ens ou plus pour produire un bool\u00E9en. \u00C9value plusieurs d\u00E9clarations, puis renvoie un r\u00E9sultat positif si une seule d'entre elles est vraie. Par exemple, (1 < 3).xor(1 < 7) renvoie un r\u00E9sultat faux car plus d'une des conditions est vraie.
html_parse_html=Dans une cellule remplie de texte au format HTML, parseHtml() simplifie les balises HTML (par exemple en supprimant les '' /'' \u00E0 la fin des balises auto-fermantes), ferme toutes les balises non ferm\u00E9es et ins\u00E8re des sauts de ligne et des retraits pour un code plus propre. Une cellule ne peut pas stocker la sortie de parseHtml() \u00E0 moins que vous ne la convertissiez avec toString()\u00A0: par exemple, value.parseHtml().toString().
math_random_number=Renvoie un nombre entier al\u00E9atoire dans l'intervalle entre les bornes inf\u00E9rieure et sup\u00E9rieure (inclusivement). Un nombre al\u00E9atoire diff\u00E9rent sera g\u00E9n\u00E9r\u00E9 dans chaque cellule d'une colonne.
math_sinh=Renvoie le sinus hyperbolique d'un angle.
math_sum=Renvoie la somme des nombres contenus dans le tableau. Ne tient pas compte des \u00E9l\u00E9ments qui ne sont pas des nombres. Renvoie 0 si le tableau ne contient pas de nombre.
math_quotient=Renvoie la partie enti\u00E8re d'une division (tronqu\u00E9e, non arrondie), lorsqu'elle est fournie avec un num\u00E9rateur et un d\u00E9nominateur.
