

# Functions
# 1. Arrays
arr_args_to_array=Retorna tots els arguments que se li han passat com a matriu
arr_sort=Ordena la matriu en ordre ascendent. L'ordenaci\u00F3 distingeix entre maj\u00FAscules i min\u00FAscules, primer i segon.
bool_not=Utilitza l'operador l\u00F2gic NOT en un boole\u00E0 per a generar un boole\u00E0. Per exemple, not(1 > 7) retorna cert perqu\u00E8 1 > 7 \u00E9s fals.
arr_reverse=Inverteix la matriu a.
arr_join=Uneix els elements de la matriu amb sep, i ho retorna tot com una cadena.

# 3. Date
date_part=Retorna part d'una data. El tipus de dades retornades dep\u00E8n de la unitat. Vegeu https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit, https://openrefine.org/docs/manual/grelfunctions#date-functions per a una taula.
bool_xor=Utilitza l'operador l\u00F2gic XOR (exclusiu-or) en dos o m\u00E9s booleans per a generar un boole\u00E0. Avalua m\u00FAltiples sent\u00E8ncies, llavors retorna cert si nom\u00E9s un d'ells \u00E9s cert. Per exemple, (1 < 3).xor(1 < 7) retorna fals perqu\u00E8 m\u00E9s d'una de les condicions \u00E9s certa.
html_parse_html=Donada una cel\u00B7la plena de text formatat en HTML, parseHtml() simplifica les etiquetes HTML (com ara eliminant '' /'' al final de les etiquetes d'autotancament), tanca qualsevol etiqueta sense tancar i insereix salts de l\u00EDnia i sagnats per a un codi m\u00E9s net. Una cel\u00B7la no pot emmagatzemar la sortida de parseHtml() a menys que la convertiu amb toString(): per exemple, value.parseHtml().toString().
arr_uniques=Retorna la matriu amb duplicats eliminats. Distingeix entre maj\u00FAscules i min\u00FAscules.
arr_in_array=Retorna true (vertader) si la matriu cont\u00E9 la cadena desitjada, i false (fals) en cas contrari. No convertir\u00E0 els tipus de dades.

# 4. HTML
html_inner_html=Retorna l'HTML interior d'un element HTML. Aix\u00F2 inclour\u00E0 text i elements fills dins de l'element seleccionat. Utilitzeu-lo conjuntament amb parseHtml() i select() per a proporcionar un element.
bool_or=Utilitza l'operador l\u00F2gic OR en dos o m\u00E9s booleans per a generar un boole\u00E0. Per exemple, (1 < 3).or(1 > 7) retorna cert perqu\u00E8 almenys una de les condicions (la primera) \u00E9s certa.

# 2. Booleans
bool_and=Utilitza l'operador l\u00F2gic AND en dos o m\u00E9s booleans per a emetre un boole\u00E0. Avalua m\u00FAltiples declaracions en booleans, llavors retorna cert si totes les declaracions s\u00F3n certes. Per exemple, (1 < 3).and(1 < 0) retorna fals perqu\u00E8 una condici\u00F3 \u00E9s certa i una \u00E9s falsa.
date_now=Retorna l'hora actual segons el rellotge del sistema, en el format ampliat ISO 8601 (convertit a UTC). Per exemple, 10:53am (i 00 segons) del 26 de novembre de 2020 a EST retorna [date 2020-11-26T15:53:00Z].

# 5. Math
math_abs=Retorna el valor absolut d'un nombre.
date_inc=Retorna una data canviada per la quantitat indicada en la unitat de temps indicada, en cometes. Vegeu https://openrefine.org/docs/manual/grelfunctions/#incd-n-s-timeunit per a una taula. La unitat per defecte \u00E9s ''hora''. Un valor positiu augmenta la data i un valor negatiu la mou en el temps.
math_acos=Retorna l'arccosinus d'un angle, en l'interval 0 a PI.
math_asin=Retorna l'arcsinus d'un angle en l'interval de -PI/2 a PI/2.
fun_time_since_unix_epoch_to_date=Retorna un nombre convertit a una data basada en l'hora d'Unix. El nombre pot ser Temps d'Epoch d'Unix en una de les seg\u00FCents unitats suportades: segon, mil\u00B7lisegon, microsegon. Per defecte \u00E9s "segon".
fun_to_string=Pren qualsevol tipus de valor (cadena, n\u00FAmero, data, boole\u00E0, error, nul) i dona una versi\u00F3 de cadena d'aquest valor. Podeu convertir n\u00FAmeros a cadenes amb arrodoniment, utilitzant un format de cadena opcional. Vegeu https://docs.oracle.com/javase/8/docs/api/java/util/Formatter.html. Tamb\u00E9 podeu convertir dates a cadenes utilitzant la sintaxi d'an\u00E0lisi de dates. Vegeu https://openrefine.org/docs/manual/grelfunctions/#date-functions.
str_sha1=Retorna el hash SHA-1 d'un objecte. Si s'alimenta alguna cosa diferent d'una cadena (array, n\u00FAmero, data, etc.), sha1() la convertir\u00E0 en una cadena i lliurar\u00E0 el resum de la cadena.
math_odd=Arrodoneix el nombre fins a l'enter senar m\u00E9s proper.
math_quotient=Retorna la porci\u00F3 entera d'una divisi\u00F3 (truncada, no arrodonida), quan se subministra amb un numerador i un denominador.
math_round=Arrodoneix un nombre a l'enter m\u00E9s proper.
math_sum=Retorna la suma dels nombres de la matriu. Ignora els elements no numerables. Retorna 0 si la matriu no cont\u00E9 nombres.
str_decode=Descodifica una cadena utilitzant la codificaci\u00F3 especificada. Les codificacions inclouen Base16, Base32Hex, Base32, Base64, i Base64Url.
str_find=Emet una matriu de totes les subcadenes consecutives dins de la cadena s que coincideixen amb la subcadena o el patr\u00F3 d'expressi\u00F3 regular p. Podeu subministrar una subcadena posant-la entre cometes. Vegeu tamb\u00E9 match().
str_ends_with=Retorna un boole\u00E0 indicant si s acaba amb sub. Per exemple, "food".endsWith("ood") retorna cert, mentre que "food".endsWith("odd") retorna fals.
str_last_index_of=Retorna el primer \u00EDndex de car\u00E0cters de sub tal com apareix per \u00FAltima vegada a s; o, retorna -1 si s no cont\u00E9 sub. Per exemple, "paral\u00B7lel".lastIndexOf("a") retorna 3 (indicant la segona ''a'').
str_md5=Retorna el hash MD5 d'un objecte. Si s'alimenta alguna cosa diferent d'una cadena (array, n\u00FAmero, data, etc.), md5() la convertir\u00E0 en una cadena i lliurar\u00E0 el resum de la cadena.
str_partition=Retorna una matriu de cadenes [ a, fragment, z ] on a \u00E9s la subcadena dins de s abans de la primera ocurr\u00E8ncia de fragment, i z \u00E9s la subcadena despr\u00E9s de fragment. El fragment pot ser una cadena o una expressi\u00F3 regular. Si omitFragment \u00E9s cert, el frag no es retorna.
str_phonetic=Retorna una codificaci\u00F3 fon\u00E8tica d'una cadena, basada en un algorisme fon\u00E8tic disponible. Pot ser un dels seg\u00FCents m\u00E8todes fon\u00E8tics suportats: met\u00E0fon, doblemet\u00E0fon, metaf\u00F2nic3, soundex, cologne. Per defecte \u00E9s \u00ABmetaphone3\u00BB.
str_replace_chars=Retorna la cadena obtinguda substituint un car\u00E0cter en s, identificat per cerca, amb el car\u00E0cter corresponent identificat en reempla\u00E7a. No podeu utilitzar aix\u00F2 per a substituir un sol car\u00E0cter per m\u00E9s d'un car\u00E0cter.
str_rpartition=Retorna una matriu de cadenes [ a, fragment, z ] on a \u00E9s la subcadena dins de s abans de l'\u00FAltima ocurr\u00E8ncia de fragment, i z \u00E9s la subcadena despr\u00E9s de l'\u00FAltima inst\u00E0ncia de fragment. Si omitFragment \u00E9s cert, el frag no es retorna.
str_split=Retorna la matriu de cadenes obtingudes separant s per sep. El separador pot ser una cadena o un patr\u00F3 d'expressi\u00F3 regular. Si preserveTokens \u00E9s cert, es conserven segments buits.
str_to_title_case=Retorna la cadena s convertida en maj\u00FAscules: una lletra maj\u00FAscula que comen\u00E7a cada paraula i la resta de lletres en min\u00FAscula. Per exemple, ''Vet aqu\u00ED que una vegada hi havia una mitjanit L\u00DAGUBRE''.toTitlecase() retorna la cadena ''Vet Aqu\u00ED Que Una Vegada Hi Havia Una Mitjanit L\u00FAgubre''.
xml_scripttext=Retorna les dades combinades d'un element HTML/XML. Les dades s\u00F3n, per exemple, l'interior d'una etiqueta &lt;script&gt;.\nTingueu en compte que les dades NO s\u00F3n el text de l'element.\nUtilitzeu htmlText() per a obtenir el text que ser\u00E0 visible per a un usuari, i scriptText() per als continguts de &lt;script&gt;, &lt;style&gt;, etc.\nUtilitzeu scriptText() conjuntament amb parseHtml() i select().
xml_xmltext=Retorna una cadena del text dins d'un element HTML o XML (inclosos tots els elements fills), eliminant etiquetes i salts de l\u00EDnia dins de la cadena. Utilitzeu-lo conjuntament amb parseHtml() o parseXml() i select() per a proporcionar un element.
fun_cross=Cerca el valor indicat a la columna de destinaci\u00F3 del projecte de destinaci\u00F3, retorna una matriu de files coincidents. Dos valors coincideixen si i nom\u00E9s si tenen la mateixa representaci\u00F3 de cadena. El primer argument s'interpretar\u00E0 com a cell.value si s'estableix a cell. El segon argument s'interpretar\u00E0 com el nom del projecte actual si s'omet o s'estableix a "". El tercer argument s'interpretar\u00E0 com la columna d'\u00EDndex (comen\u00E7a des de 0) si s'omet o s'estableix a "".
fun_has_field=Retorna un boole\u00E0 indicant si o t\u00E9 un camp membre anomenat nom.
fun_jsonize=Cita un valor com a valor literal JSON.
fun_slice=Donada una cadena, retorna la subcadena que comen\u00E7a des de l'\u00EDndex de car\u00E0cters de, i fins a l'\u00EDndex de car\u00E0cters a. Si s'omet l'argument a, retornar\u00E0 fins al final de s. Recordeu, els \u00EDndexs de car\u00E0cters comencen des de zero. Donada una matriu, retorna una sub-matriu des del primer \u00EDndex proporcionat fins a i incloent l'\u00FAltim \u00EDndex proporcionat. Si s'omet el valor a, s'ent\u00E9n que \u00E9s el final de la matriu. Una part, nom\u00E9s.
fun_to_date=Retorna l'objecte introdu\u00EFt convertit a un objecte de data. Sense arguments, retorna el format ampliat ISO 8601. Amb arguments, podeu controlar el format de sortida. Amb monthFirst: estableix fals si la data es formata amb el dia anterior al mes. Amb formatN: intenta analitzar la data utilitzant una llista ordenada de formats possibles. Proporcioneu formats basats en la sintaxi SimpleDateFormat: <a href="http://docs.oracle.com/javase/7/docs/api/java/text/SimpleDateFormat.html">SimpleDateFormat</a>.
fun_type=Retorna una cadena amb el tipus de dades de o, com ara no definit, cadena, nombre, boole\u00E0, etc.
str_diff=Per a les cadenes, pren dues cadenes i les compara, tornant una cadena. Retorna la resta d'o2 comen\u00E7ant pel primer car\u00E0cter on difereixen. Per a les dates, retorna la difer\u00E8ncia en les unitats de temps indicades. Vegeu la taula de la unitat de temps a https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit.
math_atan=Retorna l'arc tangent d'un angle en el rang de -PI/2 a PI/2.
math_atan2=Converteix coordenades rectangulars (n1, n2) a polars (r, theta). Retorna el nombre theta.
math_ceil=Retorna el sostre d'un nombre.
math_combin=Retorna el nombre de combinacions per a n2 elements dividits en n1.
math_cos=Retorna el cosinus trigonom\u00E8tric d'un angle.
math_cosh=Retorna el cosinus hiperb\u00F2lic d'un valor.
math_degrees=Converteix un angle de radians a graus.
math_even=Arrodoneix el nombre fins a l'enter parell m\u00E9s proper.
math_exp=Retorna e a la pot\u00E8ncia de n.
math_fact=Retorna el factorial d'un nombre, comen\u00E7ant des de 1.
math_factn=Retorna el factorial de n1, comen\u00E7ant per n2.
math_floor=Retorna el terra d'un nombre.
math_gcd=Retorna el m\u00E0xim com\u00FA denominador de dos nombres.
math_lcm=Retorna el m\u00EDnim com\u00FA m\u00FAltiple de dos nombres.
math_ln=Retorna el logaritme natural de n.
math_log=Retorna el logaritme base 10 de n.
math_max=Retorna el m\u00E9s gran de dos nombres.
math_min=Retorna el m\u00E9s petit de dos nombres.
math_mod=Retorna n1 m\u00F2dul n2.
math_multinomial=Calcula el multinomial d'un nombre o una s\u00E8rie de nombres.
math_pow=Retorna n1 elevat a la pot\u00E8ncia de n2.
math_radians=Converteix un angle en graus a radians.
math_random_number=Retorna un enter aleatori en l'interval entre els l\u00EDmits inferior i superior (inclusivament). Es generar\u00E0 un nombre aleatori diferent a cada cel\u00B7la d'una columna.
math_sin=Retorna el sinus trigonom\u00E8tric d'un angle.
math_sinh=Retorna el sinus hiperb\u00F2lic d'un angle.
math_tan=Retorna la tangent trigonom\u00E8trica d'un angle.
math_tanh=Retorna la tangent hiperb\u00F2lica d'un angle.

# 6. Strings
str_chomp=Retorna una c\u00F2pia de la cadena s amb cadena sep eliminada des del final si s acaba amb sep; altrament, retorna s.
str_contains=Retorna un boole\u00E0 que indica si s cont\u00E9 sub, que \u00E9s una subcadena o un patr\u00F3 d'expressi\u00F3 regular. Per exemple, "food".contains("oo") retorna cert.
str_detect_language=Detecta l'idioma de la cadena indicada i proporciona el codi d'idioma.
str_encode=Codifica una cadena utilitzant la codificaci\u00F3 especificada. Les codificacions inclouen Base16, Base32Hex, Base32, Base64, i Base64Url.
str_escape=Escapa s en el mode d'escapament indicat. El mode pot ser un de: ''html'', ''xml'', csv'', ''url'', ''javascript'', ''urlpath'', ''urlform'', ''urlfragment''. Tingueu en compte que es requereixen cometes al voltant del vostre mode.
str_fingerprint=Retorna l'empremta digital de s, una cadena que \u00E9s el primer pas en els m\u00E8todes d'agrupament d'empremtes digitals: retallar\u00E0 els espais en blanc, convertir\u00E0 tots els car\u00E0cters a min\u00FAscules, eliminar\u00E0 la puntuaci\u00F3, ordenar\u00E0 les paraules alfab\u00E8ticament, etc.
str_index_of=Retorna el primer \u00EDndex de car\u00E0cters de sub, tal com apareix per primera vegada a s; o, retorna -1 si s no cont\u00E9 sub. Per exemple, "internacionalitzaci\u00F3".indexOf("naci\u00F3") retorna 5.
str_match=Intenta fer coincidir la cadena s en la seva totalitat amb el patr\u00F3 d'expressi\u00F3 regular p i, si es troba el patr\u00F3, genera una matriu de tots els grups de captura (trobats en ordre). Vegeu tamb\u00E9 find().
str_ngram_fingerprint=Retorna l'empremta digital n-gram de s.
str_ngram=Retorna una matriu de la paraula n-grams de s. \u00C9s a dir, llista totes les combinacions consecutives possibles de n paraules a la cadena.
str_parse_json=Analitza una cadena com a JSON.
str_parse_uri=Analitza un URI i n'extreu els components.
str_range=Retorna una matriu on a i b s\u00F3n l'inici i el final de l'interval respectivament i c \u00E9s el pas (increment).
str_reinterpret=Retorna s reinterpretat a trav\u00E9s dels codificadors de car\u00E0cters indicats. Heu de proporcionar una de les codificacions admeses per a cada una de la font original i la sortida de destinaci\u00F3: https://docs.oracle.com/javase/1.5.0/docs/guide/intl/encoding.doc.html. Tingueu en compte que es requereixen cometes al voltant dels codificadors de car\u00E0cters.
str_replace_each=Reempla\u00E7a cada ocurr\u00E8ncia d'una subcadena en una cadena per una altra subcadena.
str_replace=Retorna la cadena obtinguda substituint la cadena de cerca per la cadena de reempla\u00E7ament a la cadena introdu\u00EFda. Per exemple, "La vaca salta sobre la lluna i mugeix".replace(''u'', ''e'') retorna la cadena "La vaca salta sobre la llena i megeix". La cerca pot ser un patr\u00F3 d'expressi\u00F3 regular. Per exemple, ''La vaca salta sobre la lluna i mugeix''.replace(/\\s+/, "")") tornar\u00E0 ''La_vaca_salta_sobre_la_lluna_i_mugeix''
str_smart_split=Retorna la matriu de cadenes obtingudes dividint s per sep, o b\u00E9 endevinant la separaci\u00F3 per tabulador o per comes si no es dona cap sep. Gestiona correctament les cometes i ent\u00E9n els car\u00E0cters cancel\u00B7lats. El separador pot ser una cadena o un patr\u00F3 d'expressi\u00F3 regular.
str_split_by_char_type=Retorna una matriu de cadenes obtingudes dividint s en grups de car\u00E0cters consecutius cada vegada que els car\u00E0cters es canvien de categoria d'Unicode.
str_split_by_lengths=Retorna la matriu de cadenes obtingudes dividint s en subcadenes amb les longituds donades. Per exemple, "internacionalitzaci\u00F3".splitByLengths(5, 6, 3) retorna una matriu de 3 cadenes: [ "inter", "nacion", "ali" ]. Es descarten car\u00E0cters excessius de la matriu de sortida.
str_starts_with=Retorna un boole\u00E0 indicant si s comen\u00E7a amb sub. Per exemple, "menjar".startsWith("men") retorna cert, mentre que "menjar".startsWith("bar") retorna fals.
str_to_lowercase=Retorna la cadena s convertida a tots els car\u00E0cters en min\u00FAscula.
str_to_uppercase=Retorna la cadena s convertida a tots els car\u00E0cters en maj\u00FAscula.
str_trim=Retorna una c\u00F2pia de la cadena s amb espais en blanc inicials i finals eliminats.
str_unescape=Desescapa s en el mode d'escapament indicat. El mode pot ser un de: ''html'', ''xml'', ''csv'', ''url'', ''javascript''. Tingueu en compte que es requereixen cometes al voltant del vostre mode.
str_unicode=Retorna una matriu de cadenes que descriuen cada car\u00E0cter de s en la seva notaci\u00F3 Unicode completa.
str_unicode_type=Retorna una matriu de cadenes que descriuen cada car\u00E0cter de s pel seu tipus Unicode.

# 7. XML
xml_innerxml=Retorna els elements XML interns d'un element XML. No retorna el text directament dins de l'element XML escollit - nom\u00E9s el contingut dels seus fills. Utilitzeu-lo conjuntament amb parseXml() i select() per a proporcionar un element.
xml_owntext=Retorna el text directament dins de l'element XML o HTML seleccionat, ignorant el text dins dels elements fills (per a aix\u00F2, utilitzeu innerXml()). Utilitzeu-lo conjuntament amb un analitzador i select() per a proporcionar un element.
xml_parent=Retorna el node pare o nul si no hi ha cap pare. Utilitzeu-lo conjuntament amb parseHtml() i select() per a proporcionar un element.
xml_parsexml=Donada una cel\u00B7la plena de text amb format XML, parseXml() retorna un document XML complet i afegeix qualsevol etiqueta de tancament que manca.
xml_selectxml=Retorna una matriu de tots els elements desitjats d'un document HTML o XML, si l'element existeix. Els elements s'identifiquen utilitzant la sintaxi del selector Jsoup: https://jsoup.org/apidocs/org/jsoup/select/Selector.html.
xml_wholetext=Selecciona el text (no codificat) d'un element i els seus fills, incloent-hi qualsevol l\u00EDnia i espais nous, i retorna una cadena de text no codificat i no normalitzat. Utilitzeu-lo conjuntament amb parseHtml() i select() per a proporcionar un element.
xml_xmlattr=Retorna una cadena d'un atribut en un element XML o HTML. Utilitzeu-lo conjuntament amb parseHtml() o parseXml() per a apuntar primer a un element.

# 8. General
fun_coalesce=Retorna el primer no nul d'una s\u00E8rie d'objectes (que significa qualsevol tipus de dades - cadena, data, nombre, boole\u00E0, etc.).
fun_facet_count=Retorna el recompte de facetes corresponent al valor d'elecci\u00F3 donat, cercant la facetExpression a choiceValue de columnName.
fun_get=Si o t\u00E9 camps amb nom, retorna el camp anomenat ''de'' de o. Si o \u00E9s una matriu, retorna una sub-matriu o[de, a]. Si o \u00E9s una cadena, retorna o.substring(de, a).
fun_length=Retorna la longitud de la cadena s com un nombre, o la mida de la matriu a, el qual significa el nombre d'objectes que hi ha al seu interior. Les matrius poden estar buides, en aquest cas length() retornar\u00E0 0.
fun_to_number=Retorna una cadena convertida en un nombre. S'intentar\u00E0 convertir altres formats en una cadena, i despr\u00E9s en un nombre. Si el valor ja \u00E9s un nombre, aquest retornar\u00E0 el nombre.
