arr_args_to_array=\u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0BB5\u0BBE\u0BA4\u0B99\u0BCD\u0B95\u0BB3\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBE\u0B95 \u0B85\u0BA9\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1
arr_uniques=\u0B85\u0B95\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA8\u0B95\u0BB2\u0BCD\u0B95\u0BB3\u0BC1\u0B9F\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BB5\u0BB4\u0B95\u0BCD\u0B95\u0BC1 \u0B89\u0BA3\u0BB0\u0BCD\u0BA4\u0BBF\u0BB1\u0BA9\u0BCD.
math_cosh=\u0B92\u0BB0\u0BC1 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0B90\u0BAA\u0BB0\u0BCD\u0BAA\u0BCB\u0BB2\u0BBF\u0B95\u0BCD \u0B95\u0BCA\u0B9A\u0BC8\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_tan=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0B95\u0BCD\u0B95\u0BCB\u0BA3\u0BB5\u0BBF\u0BAF\u0BB2\u0BCD \u0BA4\u0BCA\u0B9F\u0BC1\u0B95\u0BCB\u0B9F\u0BC1 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_parse_json=\u0B9A\u0BBE\u0BA4\u0BCA\u0BAA\u0BCA\u0B95\u0BC1 \u0B86\u0B95 \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BAA\u0BBE\u0B95\u0BC1\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_to_lowercase=\u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0B9A\u0BBF\u0BB1\u0BBF\u0BAF \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BAE\u0BCD.
xml_xmlattr=\u0B92\u0BB0\u0BC1 \u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B8E\u0B9A\u0BCD.\u0B9F\u0BBF.\u0B8E\u0BAE\u0BCD.\u0B8E\u0BB2\u0BCD \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0BAA\u0BA3\u0BCD\u0BAA\u0BC1\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAE\u0BC1\u0BA4\u0BB2\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0B9A\u0BC1\u0B9F\u0BCD\u0B9F\u0BBF\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F parsehtml () \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 parsexml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD.
fun_type=\u0BB5\u0BB0\u0BC8\u0BAF\u0BB1\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BBE\u0BA4, \u0B9A\u0BB0\u0BAE\u0BCD, \u0B8E\u0BA3\u0BCD, \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD \u0BAA\u0BCB\u0BA9\u0BCD\u0BB1 O \u0B87\u0BA9\u0BCD \u0BA4\u0BB0\u0BB5\u0BC1 \u0BB5\u0B95\u0BC8\u0BAF\u0BC1\u0B9F\u0BA9\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_rpartition=\u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 [a, \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BC1, z] \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B85\u0B99\u0BCD\u0B95\u0BC1 A \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 S \u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B92\u0BB0\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1, \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B9A\u0B9F\u0BCD \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BBF\u0BA9\u0BCD \u0B95\u0B9F\u0BC8\u0B9A\u0BBF \u0BA8\u0BBF\u0B95\u0BB4\u0BCD\u0BB5\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAA\u0BCD \u0BAA\u0BBF\u0BB1\u0B95\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0B86\u0B95\u0BC1\u0BAE\u0BCD. OMITFRAGMENT \u0B89\u0BA3\u0BCD\u0BAE\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD, FRAG \u0BA4\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BB5\u0BBF\u0BB2\u0BCD\u0BB2\u0BC8.
str_sha1=\u0B92\u0BB0\u0BC1 \u0BAA\u0BCA\u0BB0\u0BC1\u0BB3\u0BBF\u0BA9\u0BCD \u0B9A\u0BBE -1 \u0B86\u0B9A\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD (\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8, \u0B8E\u0BA3\u0BCD, \u0BA4\u0BC7\u0BA4\u0BBF \u0BAA\u0BCB\u0BA9\u0BCD\u0BB1\u0BB5\u0BC8) \u0BA4\u0BB5\u0BBF\u0BB0 \u0BB5\u0BC7\u0BB1\u0BC1 \u0B8F\u0BA4\u0BBE\u0BB5\u0BA4\u0BC1 \u0B89\u0BA3\u0BB5\u0BB3\u0BBF\u0BA4\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, \u0B9A\u0BBE 1 () \u0B85\u0BA4\u0BC8 \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BBF \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B86\u0B9A\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0BAE\u0BCD.
str_split_by_char_type=\u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BCD \u0BAF\u0BC2\u0BA9\u0BBF\u0B95\u0BCB\u0B9F\u0BCD \u0BB5\u0B95\u0BC8\u0B95\u0BB3\u0BC8 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD\u0BAA\u0BCB\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0BB0\u0BCD\u0B9A\u0BCD\u0B9A\u0BBF\u0BAF\u0BBE\u0BA9 \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0B95\u0BC1\u0BB4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BBE\u0B95\u0BAA\u0BCD \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAA\u0BC6\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_smart_split=\u0B9A\u0BC6\u0BAA\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0B8E\u0B9A\u0BCD \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAA\u0BC6\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B9A\u0BC6\u0BAA\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BBE\u0BB5\u0BBF\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD \u0BA4\u0BBE\u0BB5\u0BB2\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B95\u0BAE\u0BBE \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BC8 \u0BAF\u0BC2\u0B95\u0BBF\u0BAA\u0BCD\u0BAA\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD. \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD\u0B95\u0BB3\u0BC8 \u0B9A\u0BB0\u0BBF\u0BAF\u0BBE\u0B95\u0B95\u0BCD \u0B95\u0BC8\u0BAF\u0BBE\u0BB3\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BB0\u0BA4\u0BCD\u0BA4\u0BC1 \u0B9A\u0BC6\u0BAF\u0BCD\u0BAF\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BC8\u0BAA\u0BCD \u0BAA\u0BC1\u0BB0\u0BBF\u0BA8\u0BCD\u0BA4\u0BC1\u0B95\u0BCA\u0BB3\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BBE\u0BA9\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD.
arr_in_array=\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0BB5\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BBF\u0BAF \u0B9A\u0BB0\u0BAE\u0BCD \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD \u0B89\u0BA3\u0BCD\u0BAE\u0BC8, \u0B87\u0BB2\u0BCD\u0BB2\u0BC8\u0BAF\u0BC6\u0BA9\u0BBF\u0BB2\u0BCD \u0BA4\u0BB5\u0BB1\u0BBE\u0BA9\u0BA4\u0BC1. \u0BA4\u0BB0\u0BB5\u0BC1 \u0BB5\u0B95\u0BC8\u0B95\u0BB3\u0BC8 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BBE\u0BA4\u0BC1.
arr_join=\u0B9A\u0BC6\u0BAA\u0BCD\u0B9F\u0BAE\u0BCD\u0BAA\u0BB0\u0BCD \u0B89\u0B9F\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B89\u0BB3\u0BCD\u0BB3 \u0B89\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0B9F\u0BBF\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0B9A\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC1, \u0B85\u0BA4\u0BC8\u0BAF\u0BC6\u0BB2\u0BCD\u0BB2\u0BBE\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BBE\u0B95 \u0BA4\u0BBF\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
arr_reverse=\u0BA4\u0BB2\u0BC8\u0B95\u0BC0\u0BB4\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8 a.
arr_sort=\u0B8F\u0BB1\u0BC1\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0BAE\u0BCD \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 \u0BB5\u0BB4\u0B95\u0BCD\u0B95\u0BC1-\u0B89\u0BA3\u0BB0\u0BCD\u0BA4\u0BBF\u0BB1\u0BA9\u0BCD, \u0BAA\u0BC6\u0BB0\u0BBF\u0BAF \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B9A\u0BBF\u0BB1\u0BBF\u0BAF \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BBE\u0BB5\u0BA4\u0BC1.
arr_zip=\u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B85\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BAE\u0BC7\u0BB1\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0B95\u0BB3\u0BC8 \u0B92\u0BB0\u0BC7 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1\u0B99\u0BCD\u0B95\u0BBF\u0BA3\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1, \u0B89\u0BB3\u0BCD\u0BB3\u0BC0\u0B9F\u0BCD\u0B9F\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0B95\u0BB3\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0B92\u0BB0\u0BC7 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB2\u0BCD \u0B89\u0BB3\u0BCD\u0BB3 \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BBF\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0BA4\u0BC1\u0BA3\u0BC8 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0B89\u0BB0\u0BC1\u0BB5\u0BBE\u0B95\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9.
str_split_by_lengths=\u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA8\u0BC0\u0BB3\u0B99\u0BCD\u0B95\u0BB3\u0BC1\u0B9F\u0BA9\u0BCD S \u0B95\u0BB3\u0BC8 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BBE\u0B95\u0BAA\u0BCD \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAA\u0BC6\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0BAA\u0BA9\u0BCD\u0BA9\u0BBE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BAF\u0BAE\u0BBE\u0B95\u0BCD\u0B95\u0BB2\u0BCD ". \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0B85\u0BA4\u0BBF\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BBF\u0BAF\u0BBE\u0BA9 \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BCD \u0BA8\u0BBF\u0BB0\u0BBE\u0B95\u0BB0\u0BBF\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9.
str_split=SEP \u0B86\u0BB2\u0BCD S \u0B90 \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAA\u0BC6\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAA\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BBE\u0BA9\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD. \u0BAA\u0BBE\u0BA4\u0BC1\u0B95\u0BBE\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BB3\u0BCD \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, \u0BB5\u0BC6\u0BB1\u0BCD\u0BB1\u0BC1 \u0BAA\u0BBF\u0BB0\u0BBF\u0BB5\u0BC1\u0B95\u0BB3\u0BCD \u0BAA\u0BBE\u0BA4\u0BC1\u0B95\u0BBE\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9.
str_starts_with=\u0B8E\u0B9A\u0BCD \u0BA4\u0BC1\u0BA3\u0BC8\u0B95\u0BCD\u0B95\u0BC1 \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BBE \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0B89\u0BA3\u0BB5\u0BC1" .\u0B9A\u0BCD\u0B9F\u0BBE\u0BB0\u0BCD\u0B9F\u0BCD\u0B9A\u0BCD\u0BB5\u0BBF\u0BA4\u0BCD ("\u0B83\u0BAA\u0BC2") \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BBE\u0B95\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B85\u0BA4\u0BC7\u0B9A\u0BAE\u0BAF\u0BAE\u0BCD "\u0B89\u0BA3\u0BB5\u0BC1" .\u0B9A\u0BCD\u0B9F\u0BBE\u0BB0\u0BCD\u0B9F\u0BCD\u0B9A\u0BCD\u0BB5\u0BBF\u0BA4\u0BCD ("\u0BAA\u0BBE\u0BB0\u0BCD") \u0BAA\u0BCA\u0BAF\u0BCD\u0BAF\u0BBE\u0BA9\u0BA4\u0BC1.
fun_get=OF \u0BAA\u0BC1\u0BB2\u0B99\u0BCD\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0BAA\u0BC6\u0BAF\u0BB0\u0BBF\u0B9F\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, O \u0B87\u0BA9\u0BCD '' '' \u0B8E\u0BA9\u0BCD\u0BB1 \u0BAA\u0BC6\u0BAF\u0BB0\u0BC8\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. O \u0B92\u0BB0\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD, \u0B92\u0BB0\u0BC1 \u0BA4\u0BC1\u0BA3\u0BC8 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8 O [from, to] \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. O \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD, o.substring (from, to) \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
fun_has_field=O \u0B95\u0BCD\u0B95\u0BC1 \u0BAA\u0BC6\u0BAF\u0BB0\u0BCD \u0B8E\u0BA9\u0BCD\u0BB1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BB0\u0BCD \u0BAA\u0BC1\u0BB2\u0BAE\u0BCD \u0B89\u0BB3\u0BCD\u0BB3\u0BA4\u0BBE \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
fun_jsonize=\u0B92\u0BB0\u0BC1 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC8 \u0B9A\u0BBE\u0BA4\u0BCA\u0BAA\u0BCA\u0B95\u0BC1 \u0BA8\u0BC7\u0BB0\u0B9F\u0BBF \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BBE\u0B95 \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD \u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
fun_length=\u0B9A\u0BB0\u0BAE\u0BCD s \u0B87\u0BA9\u0BCD \u0BA8\u0BC0\u0BB3\u0BA4\u0BCD\u0BA4\u0BC8 \u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBE\u0B95 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8 A \u0B87\u0BA9\u0BCD \u0B85\u0BB3\u0BB5\u0BC8\u0B95\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B85\u0BA4\u0BBE\u0BB5\u0BA4\u0BC1 \u0B85\u0BA4\u0BA9\u0BCD \u0B89\u0BB3\u0BCD\u0BB3\u0BC7 \u0B89\u0BB3\u0BCD\u0BB3 \u0BAA\u0BCA\u0BB0\u0BC1\u0B9F\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0B95\u0BCD\u0B95\u0BC8. \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0B95\u0BB3\u0BCD \u0B95\u0BBE\u0BB2\u0BBF\u0BAF\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD, \u0B87\u0BA8\u0BCD\u0BA4 \u0BB5\u0BBF\u0B9A\u0BAF\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD \u0BA8\u0BC0\u0BB3\u0BAE\u0BCD () 0 \u0BA4\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BC1\u0BAE\u0BCD.
bool_and=\u0B92\u0BB0\u0BC1 \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0BB5\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BA4\u0BB0\u0BC1\u0B95\u0BCD\u0B95 \u0B86\u0BAA\u0BB0\u0BC7\u0B9F\u0BCD\u0B9F\u0BB0\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B85\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BAE\u0BC7\u0BB1\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD\u0B95\u0BB3\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD\u0B95\u0BB3\u0BBE\u0B95 \u0BAA\u0BB2 \u0B85\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC8\u0B95\u0BB3\u0BC8 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC0\u0B9F\u0BC1 \u0B9A\u0BC6\u0BAF\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0BAA\u0BBF\u0BA9\u0BCD\u0BA9\u0BB0\u0BCD \u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0B85\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC8\u0B95\u0BB3\u0BC1\u0BAE\u0BCD \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, (1 <3) .\u0BAE\u0BC7\u0BB2\u0BC1\u0BAE\u0BCD (1 <0) \u0BAA\u0BCA\u0BAF\u0BCD\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B8F\u0BA9\u0BC6\u0BA9\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0BA8\u0BBF\u0BAA\u0BA8\u0BCD\u0BA4\u0BA9\u0BC8 \u0B89\u0BA3\u0BCD\u0BAE\u0BC8 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BC1 \u0BA4\u0BB5\u0BB1\u0BBE\u0BA9\u0BA4\u0BC1.
bool_or=\u0B92\u0BB0\u0BC1 \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0BB5\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BA4\u0BB0\u0BC1\u0B95\u0BCD\u0B95 \u0B86\u0BAA\u0BB0\u0BC7\u0B9F\u0BCD\u0B9F\u0BB0\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B85\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BAE\u0BC7\u0BB1\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD\u0B95\u0BB3\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, (1 <3) .\u0B93\u0BB0\u0BCD (1> 7) \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B8F\u0BA9\u0BC6\u0BA9\u0BBF\u0BB2\u0BCD \u0B95\u0BC1\u0BB1\u0BC8\u0BA8\u0BCD\u0BA4\u0BA4\u0BC1 \u0B92\u0BB0\u0BC1 \u0BA8\u0BBF\u0BAA\u0BA8\u0BCD\u0BA4\u0BA9\u0BC8\u0B95\u0BB3\u0BCD (\u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BC1) \u0B89\u0BA3\u0BCD\u0BAE\u0BC8.
bool_not=\u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0BB5\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BBF\u0BB2\u0BCD \u0B87\u0BB2\u0BCD\u0BB2\u0BBE\u0BA4 \u0BA4\u0BB0\u0BC1\u0B95\u0BCD\u0B95 \u0B86\u0BAA\u0BB0\u0BC7\u0B9F\u0BCD\u0B9F\u0BB0\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, \u0B87\u0BB2\u0BCD\u0BB2\u0BC8 (1> 7) \u0B89\u0BA3\u0BCD\u0BAE\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B8F\u0BA9\u0BC6\u0BA9\u0BBF\u0BB2\u0BCD 1> 7 \u0BA4\u0BBE\u0BA9\u0BC7 \u0BA4\u0BB5\u0BB1\u0BBE\u0BA9\u0BA4\u0BC1.
bool_xor=\u0B92\u0BB0\u0BC1 \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0BB5\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B85\u0BA4\u0BB1\u0BCD\u0B95\u0BC1 \u0BAE\u0BC7\u0BB1\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BCD\u0B95 \u0B86\u0BAA\u0BB0\u0BC7\u0B9F\u0BCD\u0B9F\u0BB0\u0BCD XOR (\u0BAA\u0BBF\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BAF\u0BC7\u0B95-OR) \u0B90\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAA\u0BB2 \u0B85\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC8\u0B95\u0BB3\u0BC8 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BBF\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0BAA\u0BBF\u0BA9\u0BCD\u0BA9\u0BB0\u0BCD \u0B85\u0BB5\u0BB1\u0BCD\u0BB1\u0BBF\u0BB2\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BC1 \u0BAE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BC7 \u0B89\u0BA3\u0BCD\u0BAE\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, (1 <3) .xor (1 <7) \u0BAA\u0BCA\u0BAF\u0BCD\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B8F\u0BA9\u0BC6\u0BA9\u0BBF\u0BB2\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0BAE\u0BC7\u0BB1\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA8\u0BBF\u0BAA\u0BA8\u0BCD\u0BA4\u0BA9\u0BC8\u0B95\u0BB3\u0BCD \u0B89\u0BA3\u0BCD\u0BAE\u0BC8.
date_part=\u0B92\u0BB0\u0BC1 \u0BA4\u0BC7\u0BA4\u0BBF\u0BAF\u0BBF\u0BA9\u0BCD \u0B92\u0BB0\u0BC1 \u0BAA\u0B95\u0BC1\u0BA4\u0BBF\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BA4\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BBF\u0BAF \u0BA4\u0BB0\u0BB5\u0BC1 \u0BB5\u0B95\u0BC8 \u0B85\u0BB2\u0B95\u0BC1 \u0B9A\u0BBE\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC1\u0BB3\u0BCD\u0BB3\u0BA4\u0BC1. Https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit, https://openrefine.org/docs/manual/grelfunctions#date- \u0B9A\u0BC6\u0BAF\u0BB2\u0BCD\u0BAA\u0BBE\u0B9F\u0BC1\u0B95\u0BB3\u0BCD \u0BAA\u0BBE\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
date_inc=\u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA8\u0BC7\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B95\u0BBE\u0BB2\u0BAA\u0BCD\u0BAA\u0B95\u0BC1\u0BA4\u0BBF\u0BAF\u0BBF\u0BB2\u0BCD, \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA4\u0BCA\u0B95\u0BC8\u0BAF\u0BBE\u0BB2\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA4\u0BC7\u0BA4\u0BBF\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B92\u0BB0\u0BC1 \u0B85\u0B9F\u0BCD\u0B9F\u0BB5\u0BA3\u0BC8\u0B95\u0BCD\u0B95\u0BC1 https://openrefine.org/docs/manual/grelfunctrys/#incd-n-s-s-timeunit \u0B90\u0BAA\u0BCD \u0BAA\u0BBE\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD. \u0B87\u0BAF\u0BB2\u0BCD\u0BAA\u0BC1\u0BA8\u0BBF\u0BB2\u0BC8 \u0B85\u0BB2\u0B95\u0BC1 '' \u0BAE\u0BA3\u0BBF\u0BA8\u0BC7\u0BB0\u0BAE\u0BCD ''. \u0BA8\u0BC7\u0BB0\u0BCD\u0BAE\u0BB1\u0BC8\u0BAF\u0BBE\u0BA9 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0BA4\u0BC7\u0BA4\u0BBF\u0BAF\u0BC8 \u0B85\u0BA4\u0BBF\u0B95\u0BB0\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0BAE\u0BC7\u0BB2\u0BC1\u0BAE\u0BCD \u0B8E\u0BA4\u0BBF\u0BB0\u0BCD\u0BAE\u0BB1\u0BC8 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0B85\u0BA4\u0BC8 \u0B9A\u0BB0\u0BBF\u0BAF\u0BBE\u0BA9 \u0BA8\u0BC7\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD \u0BA8\u0B95\u0BB0\u0BCD\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
date_now=\u0B90\u0B8E\u0B9A\u0BCD\u0B93 8601 \u0BA8\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BB5\u0B9F\u0BBF\u0BB5\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD (UTC \u0B86\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1) \u0B89\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0B95\u0BA3\u0BBF\u0BA9\u0BBF \u0B95\u0B9F\u0BBF\u0B95\u0BBE\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD\u0BAA\u0B9F\u0BBF \u0BA4\u0BB1\u0BCD\u0BAA\u0BCB\u0BA4\u0BC8\u0BAF \u0BA8\u0BC7\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, \u0BA8\u0BB5\u0BAE\u0BCD\u0BAA\u0BB0\u0BCD 26, 2020 \u0B85\u0BA9\u0BCD\u0BB1\u0BC1 \u0B95\u0BBE\u0BB2\u0BC8 10:53 (\u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD 00 \u0BB5\u0BBF\u0BA9\u0BBE\u0B9F\u0BBF\u0B95\u0BB3\u0BCD) est \u0BB5\u0BB0\u0BC1\u0BAE\u0BBE\u0BA9\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD [\u0BA4\u0BC7\u0BA4\u0BBF 2020-11-26T15: 53: 00Z].
html_inner_html=\u0B92\u0BB0\u0BC1 \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0B89\u0BB3\u0BCD \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B89\u0BB0\u0BC8 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B95\u0BC1\u0BB4\u0BA8\u0BCD\u0BA4\u0BC8\u0B95\u0BB3\u0BCD \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BCD \u0B87\u0BA4\u0BBF\u0BB2\u0BCD \u0B85\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0BAE\u0BCD. Parsehtml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95 () \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
math_multinomial=\u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0BB0\u0BCD \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BAA\u0BA9\u0BCD\u0BAE\u0BC1\u0B95\u0BA4\u0BCD\u0BA4\u0BA9\u0BCD\u0BAE\u0BC8\u0BAF\u0BC8\u0B95\u0BCD \u0B95\u0BA3\u0B95\u0BCD\u0B95\u0BBF\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_odd=\u0B85\u0BB0\u0BC1\u0B95\u0BBF\u0BB2\u0BC1\u0BB3\u0BCD\u0BB3 \u0B92\u0BB1\u0BCD\u0BB1\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BC8 \u0BAE\u0BC1\u0BB4\u0BC1 \u0B8E\u0BA3\u0BCD \u0BB5\u0BB0\u0BC8 \u0B8E\u0BA3\u0BCD\u0BA3\u0BC8 \u0B9A\u0BC1\u0BB1\u0BCD\u0BB1\u0BBF \u0BB5\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_pow=N1 \u0B87\u0BA9\u0BCD \u0B9A\u0B95\u0BCD\u0BA4\u0BBF\u0B95\u0BCD\u0B95\u0BC1 \u0B89\u0BAF\u0BB0\u0BCD\u0BA4\u0BCD\u0BA4\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F N1 \u0B90\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_quotient=\u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BB5\u0B95\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BB0\u0BC1\u0B9F\u0BA9\u0BCD \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BAE\u0BCD \u0BAA\u0BCB\u0BA4\u0BC1, \u0B92\u0BB0\u0BC1 \u0BAA\u0BBF\u0BB0\u0BBF\u0BB5\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0BB4\u0BC1 \u0BAA\u0B95\u0BC1\u0BA4\u0BBF\u0BAF\u0BC8 (\u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BBF\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BA4\u0BC1, \u0BB5\u0B9F\u0BCD\u0B9F\u0BAE\u0BBE\u0BA9\u0BA4\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2) \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_radians=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BC8 \u0B9F\u0BBF\u0B95\u0BBF\u0BB0\u0BBF\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0BB0\u0BC7\u0B9F\u0BBF\u0BAF\u0BA9\u0BCD\u0B95\u0BB3\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_round=\u0B85\u0BB0\u0BC1\u0B95\u0BBF\u0BB2\u0BC1\u0BB3\u0BCD\u0BB3 \u0BAE\u0BC1\u0BB4\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BC8\u0B9A\u0BCD \u0B9A\u0BC1\u0BB1\u0BCD\u0BB1\u0BBF \u0BB5\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_random_number=\u0B95\u0BC0\u0BB4\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BAE\u0BC7\u0BB2\u0BCD \u0B8E\u0BB2\u0BCD\u0BB2\u0BC8\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0B87\u0B9F\u0BC8\u0BAF\u0BBF\u0BB2\u0BBE\u0BA9 \u0B87\u0B9F\u0BC8\u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0BB2\u0BCD (\u0B89\u0BB3\u0BCD\u0BB3\u0B9F\u0B95\u0BCD\u0B95\u0BBF\u0BAF) \u0B87\u0B9F\u0BC8\u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BC0\u0BB0\u0BB1\u0BCD\u0BB1 \u0BAE\u0BC1\u0BB4\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B92\u0BB0\u0BC1 \u0BA8\u0BC6\u0B9F\u0BC1\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0B95\u0BB2\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BC1\u0BAE\u0BCD \u0BB5\u0BC6\u0BB5\u0BCD\u0BB5\u0BC7\u0BB1\u0BC1 \u0B9A\u0BC0\u0BB0\u0BB1\u0BCD\u0BB1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BC8 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0BAE\u0BCD.
math_sin=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0B95\u0BCD\u0B95\u0BCB\u0BA3\u0BB5\u0BBF\u0BAF\u0BB2\u0BCD \u0B9A\u0BC8\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_sinh=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B90\u0BAA\u0BB0\u0BCD\u0BAA\u0BCB\u0BB2\u0BBF\u0B95\u0BCD \u0B9A\u0BC8\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_sum=\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B89\u0BB3\u0BCD\u0BB3 \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BA4\u0BCA\u0B95\u0BC8\u0BAF\u0BC8 \u0BA4\u0BBF\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA4\u0BCD \u0BA4\u0BB0\u0BB5\u0BC1\u0BAE\u0BCD. \u0B8E\u0BA3\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BBE\u0BA4 \u0B89\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0B9F\u0BBF\u0B95\u0BB3\u0BC8 \u0BAA\u0BC1\u0BB1\u0B95\u0BCD\u0B95\u0BA3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BCD \u0B87\u0BB2\u0BCD\u0BB2\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD 0 \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_tanh=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B90\u0BAA\u0BB0\u0BCD\u0BAA\u0BCB\u0BB2\u0BBF\u0B95\u0BCD \u0BA4\u0BCA\u0B9F\u0BC1\u0BA4\u0BB2\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_chomp=\u0B8E\u0B9A\u0BCD \u0B9A\u0BC6\u0BAA\u0BCD\u0B9F\u0BAE\u0BCD\u0BAA\u0BB0\u0BCD \u0B89\u0B9F\u0BA9\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0B9F\u0BC8\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, \u0B9A\u0BB0\u0BAE\u0BCD S \u0B87\u0BA9\u0BCD \u0BA8\u0B95\u0BB2\u0BC8 \u0B9A\u0BB0\u0BAE\u0BCD SEP \u0B89\u0B9F\u0BA9\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0BBF\u0BB2\u0BCD \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0B85\u0B95\u0BB1\u0BCD\u0BB1\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1; \u0B87\u0BB2\u0BCD\u0BB2\u0BC8\u0BAF\u0BC6\u0BA9\u0BBF\u0BB2\u0BCD, \u0B8E\u0B9A\u0BCD.
str_contains=\u0B8E\u0B9A\u0BCD \u0B9A\u0BAA\u0BCD \u0B89\u0BB3\u0BCD\u0BB3\u0BA4\u0BBE \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B87\u0BA4\u0BC1 \u0B92\u0BB0\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0BAE\u0BC1\u0BB1\u0BC8. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0B89\u0BA3\u0BB5\u0BC1" .\u0B92\u0BB0\u0BC1 ("OO") \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_decode=\u0B95\u0BC1\u0BB1\u0BBF\u0BAA\u0BCD\u0BAA\u0BBF\u0B9F\u0BCD\u0B9F \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0BA4\u0BCD\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0B9F\u0BBF\u0B95\u0BCB\u0B9F\u0BCD \u0B9A\u0BC6\u0BAF\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD BASE16, BASE32HEX, BASE32, BASE64, \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD BASE64URL \u0B86\u0B95\u0BBF\u0BAF\u0BB5\u0BC8 \u0B85\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0BAE\u0BCD.
str_detect_language=\u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0BAE\u0BCA\u0BB4\u0BBF\u0BAF\u0BC8\u0B95\u0BCD \u0B95\u0BA3\u0BCD\u0B9F\u0BB1\u0BBF\u0BA8\u0BCD\u0BA4\u0BC1 \u0BAE\u0BCA\u0BB4\u0BBF \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_diff=\u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1, \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BC8 \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0B85\u0BB5\u0BB1\u0BCD\u0BB1\u0BC8 \u0B92\u0BAA\u0BCD\u0BAA\u0BBF\u0B9F\u0BCD\u0B9F\u0BC1, \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BA4\u0BBF\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. O2 \u0B87\u0BA9\u0BCD \u0B8E\u0B9E\u0BCD\u0B9A\u0BBF\u0BAF \u0BAA\u0B95\u0BC1\u0BA4\u0BBF\u0BAF\u0BC8 \u0B85\u0BB5\u0BC8 \u0BB5\u0BC7\u0BB1\u0BC1\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0BAE\u0BCD \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B95\u0BA4\u0BBE\u0BAA\u0BBE\u0BA4\u0BCD\u0BA4\u0BBF\u0BB0\u0BA4\u0BCD\u0BA4\u0BC1\u0B9F\u0BA9\u0BCD \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9. \u0BA4\u0BC7\u0BA4\u0BBF\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1, \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA8\u0BC7\u0BB0 \u0B85\u0BB2\u0B95\u0BC1\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BBF\u0BA4\u0BCD\u0BA4\u0BBF\u0BAF\u0BBE\u0B9A\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BA8\u0BC7\u0BB0 \u0B85\u0BB2\u0B95\u0BC1 \u0B85\u0B9F\u0BCD\u0B9F\u0BB5\u0BA3\u0BC8\u0BAF\u0BC8 https://openrefine.org/docs/manual/grelfunctrys/#datepartd-s-timeunit \u0B87\u0BB2\u0BCD \u0B95\u0BBE\u0BA3\u0BCD\u0B95.
str_encode=\u0B95\u0BC1\u0BB1\u0BBF\u0BAA\u0BCD\u0BAA\u0BBF\u0B9F\u0BCD\u0B9F \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0BA4\u0BCD\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BBE\u0B95\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD BASE16, BASE32HEX, BASE32, BASE64, \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD BASE64URL \u0B86\u0B95\u0BBF\u0BAF\u0BB5\u0BC8 \u0B85\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0BAE\u0BCD.
str_ends_with=\u0B8E\u0B9A\u0BCD \u0BA4\u0BC1\u0BA3\u0BC8 \u0B89\u0B9F\u0BA9\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0B9F\u0BC8\u0B95\u0BBF\u0BB1\u0BA4\u0BBE \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0B89\u0BA3\u0BB5\u0BC1" .\u0B8E\u0BA3\u0BCD\u0B9F\u0BCD\u0B9A\u0BCD ("\u0B93\u0B9F\u0BCD") \u0B89\u0BA3\u0BCD\u0BAE\u0BC8\u0BAF\u0BBE\u0B95\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B85\u0BA4\u0BC7\u0B9A\u0BAE\u0BAF\u0BAE\u0BCD "\u0B89\u0BA3\u0BB5\u0BC1" .\u0B8E\u0BA3\u0BCD\u0B9F\u0BCD\u0B9A\u0BCD ("\u0B92\u0BB1\u0BCD\u0BB1\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BC8") \u0BAA\u0BCA\u0BAF\u0BCD\u0BAF\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_escape=\u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA4\u0BAA\u0BCD\u0BAA\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0BA4\u0BAA\u0BCD\u0BAA\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAA\u0BAF\u0BA9\u0BCD\u0BAE\u0BC1\u0BB1\u0BC8 \u0B92\u0BA9\u0BCD\u0BB1\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD: '' \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA '', '' \u0BA8\u0BC0\u0B95\u0BC1\u0BAE\u0BCA '', \u0B95\u0BBE\u0BAA\u0BBF\u0BAE ',' '\u0BAE\u0BC1\u0B95\u0BB5\u0BB0\u0BBF' ',' 'javascript' ',' 'urlpath' ',' 'urlform', '' urlfragment ''. \u0B89\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BC8\u0B9A\u0BCD \u0B9A\u0BC1\u0BB1\u0BCD\u0BB1\u0BBF \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD\u0B95\u0BB3\u0BCD \u0BA4\u0BC7\u0BB5\u0BC8 \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8 \u0BA8\u0BBF\u0BA9\u0BC8\u0BB5\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0BB3\u0BCD\u0B95.
str_find=\u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0BA4\u0BCD\u0BA4\u0BC1\u0B9F\u0BA9\u0BCD \u0BAA\u0BCA\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0B95\u0BCD\u0B95\u0BC2\u0B9F\u0BBF\u0BAF \u0B9A\u0BB0\u0BAE\u0BCD s \u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0BB0\u0BCD\u0B9A\u0BCD\u0B9A\u0BBF\u0BAF\u0BBE\u0BA9 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BC0\u0B9F\u0BC1 \u0B9A\u0BC6\u0BAF\u0BCD\u0BAF\u0BC1\u0B99\u0BCD\u0B95\u0BB3\u0BCD. \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0BB5\u0BC8\u0BAA\u0BCD\u0BAA\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BA8\u0BC0\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0B92\u0BB0\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD. \u0BAA\u0BCB\u0B9F\u0BCD\u0B9F\u0BBF\u0BAF\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B95\u0BBE\u0BA3\u0BCD\u0B95 ().
str_fingerprint=\u0B95\u0BC8\u0BB0\u0BC7\u0B95\u0BC8 \u0B95\u0BBF\u0BB3\u0B9A\u0BCD\u0B9F\u0BB0\u0BBF\u0B99\u0BCD \u0BAE\u0BC1\u0BB1\u0BC8\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0BAA\u0B9F\u0BBF\u0BAF\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B8E\u0B9A\u0BCD \u0B95\u0BC8\u0BB0\u0BC7\u0B95\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1: \u0B87\u0BA4\u0BC1 \u0B92\u0BAF\u0BBF\u0B9F\u0BCD\u0B9A\u0BCD\u0BAA\u0BC7\u0B9A\u0BCD\u0B95\u0BB3\u0BC8 \u0BAA\u0BBE\u0BA4\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD, \u0B8E\u0BB2\u0BCD\u0BB2\u0BBE \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BB3\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B9A\u0BBF\u0BB1\u0BBF\u0BAF \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD, \u0BA8\u0BBF\u0BB1\u0BC1\u0BA4\u0BCD\u0BA4\u0BB1\u0BCD\u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC8 \u0B85\u0B95\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD, \u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BC8 \u0B85\u0B95\u0BB0 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BBF \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0BAE\u0BCD.
str_index_of=S \u0B87\u0BB2\u0BCD \u0BAE\u0BC1\u0BA4\u0BB2\u0BBF\u0BB2\u0BCD \u0BA8\u0BBF\u0B95\u0BB4\u0BC1\u0BAE\u0BCD \u0BAA\u0BCB\u0BA4\u0BC1 \u0BA4\u0BC1\u0BA3\u0BC8 \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB1\u0BBF \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1; \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1, \u0B8E\u0B9A\u0BCD \u0BA4\u0BC1\u0BA3\u0BC8 \u0B87\u0BB2\u0BCD\u0BB2\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD -1 \u0BA4\u0BC1\u0BA3\u0BC8. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0BAA\u0BA9\u0BCD\u0BA9\u0BBE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BAF\u0BAE\u0BBE\u0B95\u0BCD\u0B95\u0BB2\u0BCD" .\u0B87\u0BA3\u0BCD\u0B9F\u0BC6\u0B95\u0BCD\u0B9A\u0BCB\u0B83\u0BAA\u0BCD ("\u0BA8\u0BC7\u0B9A\u0BA9\u0BCD") 5 \u0BA4\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BC1\u0BAE\u0BCD.
str_last_index_of=S \u0B87\u0BB2\u0BCD \u0B95\u0B9F\u0BC8\u0B9A\u0BBF\u0BAF\u0BBE\u0B95 \u0BA8\u0BBF\u0B95\u0BB4\u0BC1\u0BAE\u0BCD \u0BAA\u0BCB\u0BA4\u0BC1 \u0BA4\u0BC1\u0BA3\u0BC8 \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1; \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1, \u0B8E\u0B9A\u0BCD \u0BA4\u0BC1\u0BA3\u0BC8 \u0B87\u0BB2\u0BCD\u0BB2\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD -1 \u0BA4\u0BC1\u0BA3\u0BC8. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0B87\u0BA3\u0BC8\u0BAF\u0BBE\u0BA9" .\u0BB2\u0BBE\u0B9A\u0BCD\u0B9F\u0BBF\u0BA3\u0BCD\u0B9F\u0BC6\u0B95\u0BCD\u0B9A\u0BCB\u0B83\u0BAA\u0BCD ("\u0B8F") 3 \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 (\u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BBE\u0BB5\u0BA4\u0BC1 '' \u0B8F '' \u0B90 \u0B9A\u0BC1\u0B9F\u0BCD\u0B9F\u0BBF\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1).
str_md5=\u0B92\u0BB0\u0BC1 \u0BAA\u0BCA\u0BB0\u0BC1\u0BB3\u0BBF\u0BA9\u0BCD MD5 \u0B86\u0B9A\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD (\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8, \u0B8E\u0BA3\u0BCD, \u0BA4\u0BC7\u0BA4\u0BBF \u0BAA\u0BCB\u0BA9\u0BCD\u0BB1\u0BB5\u0BC8) \u0BA4\u0BB5\u0BBF\u0BB0 \u0BB5\u0BC7\u0BB1\u0BC1 \u0B8F\u0BA4\u0BBE\u0BB5\u0BA4\u0BC1 \u0B89\u0BA3\u0BB5\u0BB3\u0BBF\u0BA4\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, MD5 () \u0B85\u0BA4\u0BC8 \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BB1\u0BCD\u0B95\u0BC1 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BBF \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B86\u0B9A\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0BAE\u0BCD.
str_match=\u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0BAE\u0BC1\u0BB1\u0BC8 p \u0B95\u0BCD\u0B95\u0BC1 \u0B8E\u0BA4\u0BBF\u0BB0\u0BBE\u0B95 \u0B9A\u0BB0\u0BAE\u0BCD S \u0B90 \u0BAE\u0BC1\u0BB4\u0BC1\u0BB5\u0BA4\u0BC1\u0BAE\u0BBE\u0B95 \u0BAA\u0BCA\u0BB0\u0BC1\u0BA4\u0BCD\u0BA4 \u0BAE\u0BC1\u0BAF\u0BB1\u0BCD\u0B9A\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0BAE\u0BC7\u0BB2\u0BC1\u0BAE\u0BCD, \u0BAE\u0BC1\u0BB1\u0BC8 \u0B95\u0BBE\u0BA3\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD, \u0B95\u0BC8\u0BAA\u0BCD\u0BAA\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC1\u0BB4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD (\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B95\u0BBE\u0BA3\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1) \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B95\u0BA3\u0BCD\u0B9F\u0BC1\u0BAA\u0BBF\u0B9F\u0BBF () \u0B90\u0BAF\u0BC1\u0BAE\u0BCD \u0B95\u0BBE\u0BA3\u0BCD\u0B95.
str_ngram_fingerprint=\u0B95\u0BB3\u0BCD \u0B8E\u0BA9\u0BCD-\u0B95\u0BBF\u0BB0\u0BBE\u0BAE\u0BCD \u0B95\u0BC8\u0BB0\u0BC7\u0B95\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_ngram=\u0B95\u0BB3\u0BCD n- \u0B95\u0BBF\u0BB0\u0BBE\u0BAE\u0BCD \u0B8E\u0BA9\u0BCD\u0BB1 \u0BB5\u0BBE\u0BB0\u0BCD\u0BA4\u0BCD\u0BA4\u0BC8\u0BAF\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B85\u0BA4\u0BBE\u0BB5\u0BA4\u0BC1, \u0B87\u0BA4\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD N \u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BA4\u0BCA\u0B9F\u0BB0\u0BCD\u0B9A\u0BCD\u0B9A\u0BBF\u0BAF\u0BBE\u0BA9 \u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0B9A\u0BC7\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BC8\u0B95\u0BB3\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0BAA\u0B9F\u0BCD\u0B9F\u0BBF\u0BAF\u0BB2\u0BBF\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_parse_uri=\u0B92\u0BB0\u0BC1 \u0BAF\u0BC2\u0BB0\u0BBF \u0B90 \u0BAA\u0BBE\u0B95\u0BC1\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0B85\u0BA4\u0BA9\u0BCD \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BC8 \u0BAA\u0BBF\u0BB0\u0BBF\u0BA4\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_partition=\u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 [a, \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BC1, z] \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B85\u0B99\u0BCD\u0B95\u0BC1 A \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 S \u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B92\u0BB0\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0B86\u0B95\u0BC1\u0BAE\u0BCD, \u0BAE\u0BC7\u0BB2\u0BC1\u0BAE\u0BCD \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0BA8\u0BBF\u0B95\u0BB4\u0BCD\u0BB5\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0BAE\u0BC1\u0BA9\u0BCD\u0BA9\u0BB0\u0BCD S \u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1, \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B9A\u0B9F\u0BCD \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAA\u0BCD \u0BAA\u0BBF\u0BB1\u0B95\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0B86\u0B95\u0BC1\u0BAE\u0BCD. \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BC1 \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B92\u0BB0\u0BC1 \u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD. OMITFRAGMENT \u0B89\u0BA3\u0BCD\u0BAE\u0BC8 \u0B8E\u0BA9\u0BCD\u0BB1\u0BBE\u0BB2\u0BCD, FRAG \u0BA4\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BB5\u0BBF\u0BB2\u0BCD\u0BB2\u0BC8.
str_phonetic=\u0B95\u0BBF\u0B9F\u0BC8\u0B95\u0BCD\u0B95\u0B95\u0BCD\u0B95\u0BC2\u0B9F\u0BBF\u0BAF \u0B92\u0BB2\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0BB5\u0BB4\u0BBF\u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BBF\u0BA9\u0BCD \u0B85\u0B9F\u0BBF\u0BAA\u0BCD\u0BAA\u0B9F\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B92\u0BB2\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAA\u0BBF\u0BA9\u0BCD\u0BB5\u0BB0\u0BC1\u0BAE\u0BCD \u0B89\u0BA4\u0BB5\u0BBF \u0B92\u0BB2\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0BAE\u0BC1\u0BB1\u0BC8\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD: \u0BAE\u0BC6\u0B9F\u0BCD\u0B9F\u0BBE\u0B83\u0BAA\u0BCB\u0BA9\u0BCD, \u0B9F\u0BAA\u0BCD\u0BB3\u0BBF\u0B95\u0BCD\u0BA9\u0BC6\u0B9F\u0BCD\u0B9F\u0BBE\u0B83\u0BAA\u0BCB\u0BA9\u0BCD, \u0BAE\u0BC6\u0B9F\u0BCD\u0B9F\u0BBE\u0B83\u0BAA\u0BCB\u0BA9\u0BCD 3, \u0B9A\u0BB5\u0BC1\u0BA3\u0BCD\u0B9F\u0BC6\u0B95\u0BCD\u0B9A\u0BCD, \u0B95\u0BCA\u0BB2\u0BCB\u0BA9\u0BCD. \u0B87\u0BAF\u0BB2\u0BCD\u0BAA\u0BC1\u0BA8\u0BBF\u0BB2\u0BC8 '' Metaphone3 ''.
str_range=\u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BC7 A \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD B \u0BA4\u0BCA\u0B9F\u0B95\u0BCD\u0B95 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BB5\u0BB0\u0BAE\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD C \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 \u0BAA\u0B9F\u0BBF (\u0B85\u0BA4\u0BBF\u0B95\u0BB0\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1) \u0B86\u0B95\u0BC1\u0BAE\u0BCD.
str_reinterpret=\u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0BBF\u0B95\u0BB3\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAE\u0BB1\u0BC1\u0BAA\u0BB0\u0BBF\u0B9A\u0BC0\u0BB2\u0BA9\u0BC8 \u0B9A\u0BC6\u0BAF\u0BCD\u0BAF\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0B85\u0B9A\u0BB2\u0BCD \u0BAE\u0BC2\u0BB2\u0BA4\u0BCD\u0BA4\u0BBF\u0BB1\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B87\u0BB2\u0B95\u0BCD\u0B95\u0BC1 \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB1\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B89\u0BA4\u0BB5\u0BBF \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BC8 \u0BA8\u0BC0\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0BB5\u0BB4\u0B99\u0BCD\u0B95 \u0BB5\u0BC7\u0BA3\u0BCD\u0B9F\u0BC1\u0BAE\u0BCD: https://docs.oracle.com/javase/1.5.0/docs/guide/intl/encoding.doc.html. \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BBE\u0B95\u0BCD\u0B95\u0BBF\u0B95\u0BB3\u0BC8\u0B9A\u0BCD \u0B9A\u0BC1\u0BB1\u0BCD\u0BB1\u0BBF \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD\u0B95\u0BB3\u0BCD \u0BA4\u0BC7\u0BB5\u0BC8 \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8 \u0BA8\u0BBF\u0BA9\u0BC8\u0BB5\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0BB3\u0BCD\u0B95.
str_replace_each=\u0BAE\u0BB1\u0BCD\u0BB1\u0BCA\u0BB0\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1\u0B9F\u0BA9\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B85\u0B9F\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BBF\u0BA9\u0BCD \u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0BA8\u0BBF\u0B95\u0BB4\u0BCD\u0BB5\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BB5\u0BC1\u0BAE\u0BCD.
str_replace_chars=\u0B8E\u0B9A\u0BCD \u0B87\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC8 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0BB5\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAA\u0BC6\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8, \u0B95\u0BA3\u0BCD\u0B9F\u0BC1\u0BAA\u0BBF\u0B9F\u0BBF\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0B85\u0B9F\u0BC8\u0BAF\u0BBE\u0BB3\u0BAE\u0BCD \u0B95\u0BBE\u0BA3\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD \u0B85\u0B9F\u0BC8\u0BAF\u0BBE\u0BB3\u0BAE\u0BCD \u0B95\u0BBE\u0BA3\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BB4\u0BC8. \u0B92\u0BB0\u0BC1 \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC8 \u0B92\u0BA9\u0BCD\u0BB1\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0BAE\u0BC7\u0BB1\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BC1\u0B9F\u0BA9\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4 \u0BAE\u0BC1\u0B9F\u0BBF\u0BAF\u0BBE\u0BA4\u0BC1.
str_replace=\u0B89\u0BB3\u0BCD\u0BB3\u0BC0\u0B9F\u0BC1 \u0B9A\u0BC6\u0BAF\u0BCD\u0BAF\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC1\u0B9F\u0BA9\u0BCD \u0B95\u0BA3\u0BCD\u0B9F\u0BC1\u0BAA\u0BBF\u0B9F\u0BBF \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0BB5\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BAA\u0BC6\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, '' \u0BAE\u0BBE\u0B9F\u0BC1 \u0B9A\u0BA8\u0BCD\u0BA4\u0BBF\u0BB0\u0BA9\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BAE\u0BC2\u0B9A\u0BCD \u0BAE\u0BC0\u0BA4\u0BC1 \u0B95\u0BC1\u0BA4\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 ''. \u0B95\u0BA3\u0BCD\u0B9F\u0BC1\u0BAA\u0BBF\u0B9F\u0BBF \u0B92\u0BB0\u0BC1 \u0BB0\u0BC0\u0B9A\u0BC6\u0B95\u0BCD\u0B9A\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, '' \u0BAE\u0BBE\u0B9F\u0BC1 \u0B9A\u0BA8\u0BCD\u0BA4\u0BBF\u0BB0\u0BA9\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BAE\u0BC2\u0B9A\u0BCD \u0BAE\u0BC0\u0BA4\u0BC1 \u0B95\u0BC1\u0BA4\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 ''.
html_parse_html=\u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B89\u0BB0\u0BC8 \u0BA8\u0BBF\u0BB1\u0BC8\u0BA8\u0BCD\u0BA4 \u0B92\u0BB0\u0BC1 \u0B95\u0BB2\u0BA4\u0BCD\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BCA\u0BA3\u0BCD\u0B9F\u0BC1, parsehtml () \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA \u0B95\u0BC1\u0BB1\u0BBF\u0B9A\u0BCD\u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BC8 \u0B8E\u0BB3\u0BBF\u0BA4\u0BBE\u0B95\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 (\u0B9A\u0BC1\u0BAF-\u0BAE\u0BC2\u0B9F\u0BC1\u0BAE\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0B9A\u0BCD\u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0BBF\u0BB2\u0BCD '' /'' \u0B90 \u0B85\u0B95\u0BB1\u0BCD\u0BB1\u0BC1\u0BB5\u0BA4\u0BC1 \u0BAA\u0BCB\u0BA9\u0BCD\u0BB1\u0BB5\u0BC8), \u0B8E\u0BA8\u0BCD\u0BA4\u0BB5\u0BCA\u0BB0\u0BC1 \u0B95\u0BC1\u0BB1\u0BBF\u0B9A\u0BCD\u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0BAE\u0BC2\u0B9F\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9, \u0BAE\u0BC7\u0BB2\u0BC1\u0BAE\u0BCD \u0BB5\u0BB0\u0BBF \u0BAA\u0BBF\u0BB0\u0BC7\u0B95\u0BCD\u0B95\u0BC1\u0B95\u0BB3\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BA4\u0BC2\u0BAF\u0BCD\u0BAE\u0BC8\u0BAF\u0BBE\u0BA9 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB1\u0BCD\u0B95\u0BBE\u0BA9 \u0B87\u0BA9\u0BCD\u0B9F\u0BC6\u0BA3\u0BCD\u0B9F\u0BC1\u0B95\u0BB3\u0BC8 \u0B9A\u0BC6\u0BB0\u0BC1\u0B95\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9. \u0BA8\u0BC0\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0B85\u0BA4\u0BC8 tostring () \u0B89\u0B9F\u0BA9\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BBE\u0BB5\u0BBF\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD Parsehtml () \u0B87\u0BA9\u0BCD \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC8 \u0B9A\u0BC7\u0BAE\u0BBF\u0B95\u0BCD\u0B95 \u0BAE\u0BC1\u0B9F\u0BBF\u0BAF\u0BBE\u0BA4\u0BC1: \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, value.parsehtml (). Tostring ().
math_abs=\u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0BB4\u0BC1\u0BAE\u0BC8\u0BAF\u0BBE\u0BA9 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_acos=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B86\u0BB0\u0BCD\u0B95\u0BCD \u0B95\u0BCA\u0B9A\u0BC8\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, 0 \u0BB5\u0BB0\u0BAE\u0BCD\u0BAA\u0BBF\u0BB2\u0BCD PI \u0BB5\u0BB4\u0BBF\u0BAF\u0BBE\u0B95.
math_asin=-Pi/2 \u0BB5\u0BB0\u0BAE\u0BCD\u0BAA\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0BB5\u0BBF\u0BB2\u0BCD \u0B9A\u0BC8\u0BA9\u0BC8 \u0BAA\u0BC8/2 \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_atan=-Pi/2 \u0BB5\u0BB0\u0BAE\u0BCD\u0BAA\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0BB5\u0BBF\u0BB2\u0BCD \u0BA4\u0BCA\u0B9F\u0BC1\u0B95\u0B9F\u0BCD\u0B9F\u0BC8 \u0BAA\u0BC8/2 \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_atan2=\u0B9A\u0BC6\u0BB5\u0BCD\u0BB5\u0B95 \u0B86\u0BAF\u0B99\u0BCD\u0B95\u0BB3\u0BC8 (N1, N2) \u0BA4\u0BC1\u0BB0\u0BC1\u0BB5 (R, \u0BA4\u0BC0\u0B9F\u0BCD\u0B9F\u0BBE) \u0B86\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B8E\u0BA3\u0BCD \u0BA4\u0BC0\u0B9F\u0BCD\u0B9F\u0BBE\u0BB5\u0BC8\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_ceil=\u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0BA9\u0BCD \u0B89\u0B9A\u0BCD\u0B9A\u0BB5\u0BB0\u0BAE\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_combin=N1 \u0B8E\u0BA9 \u0BAA\u0BBF\u0BB0\u0BBF\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BC1\u0BB3\u0BCD\u0BB3 N2 \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0BA9 \u0B9A\u0BC7\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BC8\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0B95\u0BCD\u0B95\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_cos=\u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0B95\u0BCD\u0B95\u0BCB\u0BA3\u0BB5\u0BBF\u0BAF\u0BB2\u0BCD \u0B95\u0BCA\u0B9A\u0BC8\u0BA9\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_degrees=\u0BB0\u0BC7\u0B9F\u0BBF\u0BAF\u0BA9\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0B9F\u0BBF\u0B95\u0BBF\u0BB0\u0BBF\u0B95\u0BCD\u0B95\u0BC1 \u0B92\u0BB0\u0BC1 \u0B95\u0BCB\u0BA3\u0BA4\u0BCD\u0BA4\u0BC8 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_even=\u0B8E\u0BA3\u0BCD\u0BA3\u0BC8 \u0B85\u0BB0\u0BC1\u0B95\u0BBF\u0BB2\u0BC1\u0BB3\u0BCD\u0BB3 \u0B95\u0BC2\u0B9F \u0BAE\u0BC1\u0BB4\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBE\u0B95\u0B9A\u0BCD \u0B9A\u0BC1\u0BB1\u0BCD\u0BB1\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_exp=N \u0B87\u0BA9\u0BCD \u0B9A\u0B95\u0BCD\u0BA4\u0BBF\u0B95\u0BCD\u0B95\u0BC1 \u0B87 \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_fact=1 \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BBF \u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0BA9\u0BCD \u0B95\u0BBE\u0BB0\u0BA3\u0BBF\u0BAF\u0BB2\u0BC8\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_factn=N2 \u0B87\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BBF N1 \u0B87\u0BA9\u0BCD \u0B95\u0BBE\u0BB0\u0BA3\u0BBF\u0BAF\u0BB2\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_floor=\u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0BA9\u0BCD \u0BA4\u0BB3\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_gcd=\u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BAE\u0BBF\u0B95\u0BAA\u0BCD \u0BAA\u0BC6\u0BB0\u0BBF\u0BAF \u0BAA\u0BCA\u0BA4\u0BC1\u0BB5\u0BBE\u0BA9 \u0BB5\u0B95\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BB0\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_lcm=\u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BAE\u0BBF\u0B95\u0BAA\u0BCD \u0BAA\u0BC6\u0BB0\u0BBF\u0BAF \u0BAA\u0BCA\u0BA4\u0BC1\u0BB5\u0BBE\u0BA9 \u0BB5\u0B95\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BB0\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_ln=N \u0B87\u0BA9\u0BCD \u0B87\u0BAF\u0BB1\u0BCD\u0B95\u0BC8\u0BAF\u0BBE\u0BA9 \u0BAE\u0B9F\u0B95\u0BCD\u0B95\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_log=N \u0B87\u0BA9\u0BCD \u0B85\u0B9F\u0BBF\u0BAA\u0BCD\u0BAA\u0B9F\u0BC8 10 \u0BAE\u0B9F\u0B95\u0BCD\u0B95\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_max=\u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0B85\u0BA4\u0BBF\u0B95\u0BAE\u0BBE\u0B95 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_min=\u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0B9A\u0BBF\u0BB1\u0BBF\u0BAF\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
math_mod=N1 \u0BAE\u0BBE\u0B9F\u0BC1\u0BB2\u0B9A\u0BCD N2 \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_to_title_case=\u0B9A\u0BB0\u0BAE\u0BCD \u0B8E\u0B9A\u0BCD \u0B9F\u0BBF\u0B9F\u0BCD\u0B9F\u0BCD\u0BB2\u0BC6\u0B9A\u0BCD\u0B95\u0BC7\u0B9A\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1: \u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0BB5\u0BBE\u0BB0\u0BCD\u0BA4\u0BCD\u0BA4\u0BC8\u0BAF\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0BAA\u0BC6\u0BB0\u0BBF\u0BAF \u0B95\u0B9F\u0BBF\u0BA4\u0BAE\u0BCD, \u0BAE\u0BC0\u0BA4\u0BAE\u0BC1\u0BB3\u0BCD\u0BB3 \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BCD \u0B9A\u0BBF\u0BB1\u0BBF\u0BAF \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BCD. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, '' \u0B92\u0BA9\u0BCD\u0B9A\u0BCD \u0B85\u0BAA\u0BBE\u0BA9\u0BCD \u0B8E \u0BAE\u0BBF\u0B9F\u0BCD\u0BA8\u0BC8\u0B9F\u0BCD \u0BAE\u0BA8\u0BCD\u0BA4\u0BAE\u0BBE\u0BA9 ''. \u0BB5\u0BBF\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0BAE\u0BBE\u0B95, \u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BC8 \u0BAA\u0BBF\u0BB0\u0BBF\u0B95\u0BCD\u0B95 \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BAE\u0BCD \u0B9F\u0BBF\u0BB2\u0BBF\u0BAE\u0BBF\u0B9F\u0BCD\u0B9F\u0BB0\u0BCD \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0B9A\u0BB0\u0BAE\u0BCD. \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B95\u0BA4\u0BBE\u0BAA\u0BBE\u0BA4\u0BCD\u0BA4\u0BBF\u0BB0\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B9F\u0BBF\u0BB2\u0BBF\u0BAE\u0BBF\u0B9F\u0BCD\u0B9F\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAA\u0BCD \u0BAA\u0BBF\u0BB1\u0B95\u0BC1 \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B9F\u0BC6\u0BB2\u0BBF\u0BAE\u0BBF\u0B9F\u0BCD\u0B9F\u0BB0\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BBE\u0BA4 \u0BA4\u0BA9\u0BCD\u0BAE\u0BC8 \u0B86\u0B95\u0BBF\u0BAF\u0BB5\u0BC8 \u0B95\u0BC7\u0BAA\u0BCD\u0B9F\u0BBF\u0BAF\u0BB2\u0BC8\u0B9A\u0BCD \u0B9A\u0BC6\u0BAF\u0BCD\u0BAF\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BAE\u0BCD. \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BBE\u0B9F\u0BCD\u0B9F\u0BBE\u0B95, "\u0B9A\u0BC0\u0BA9\u0BCD-\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BC7\u0BB2\u0BCD \u0B9A\u0BBE\u0BB0\u0BCD\u0BB0\u0BC7" .\u0B9F\u0BCB\u0B9F\u0BBF\u0B9F\u0BCD\u0BB2\u0BC6\u0B95\u0BC7\u0B9A\u0BCD ("-") "\u0B9A\u0BC0\u0BA9\u0BCD-\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BC7\u0BB2\u0BCD \u0B9A\u0BBE\u0BB0\u0BCD\u0BB0\u0BC7" \u0B90 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_to_uppercase=\u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0BAA\u0BC6\u0BB0\u0BBF\u0BAF \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BAE\u0BCD.
str_trim=\u0BAE\u0BC1\u0BA9\u0BCD\u0BA9\u0BA3\u0BBF \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0BAA\u0BBF\u0BA9\u0BCD\u0BA4\u0B99\u0BCD\u0B95\u0BBF\u0BAF \u0BB5\u0BC8\u0B9F\u0BCD\u0B9A\u0BCD\u0BAA\u0BC7\u0B9A\u0BCD \u0B85\u0B95\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B9A\u0BB0\u0BAE\u0BCD S \u0B87\u0BA9\u0BCD \u0BA8\u0B95\u0BB2\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_unescape=\u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA4\u0BAA\u0BCD\u0BAA\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD unescapes \u0B95\u0BB3\u0BCD. \u0BAA\u0BAF\u0BA9\u0BCD\u0BAE\u0BC1\u0BB1\u0BC8 \u0B92\u0BA9\u0BCD\u0BB1\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD: '' \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA '', '' \u0BA8\u0BC0\u0B95\u0BC1\u0BAE\u0BCA '', '' \u0B95\u0BBE\u0BAA\u0BBF\u0BAE '', '' \u0BAE\u0BC1\u0B95\u0BB5\u0BB0\u0BBF '', '' \u0B9A\u0BBE\u0BB5\u0BBE\u0B9A\u0BCD\u0B95\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0B9F\u0BCD ''. \u0B89\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAE\u0BC1\u0BB1\u0BC8\u0BAF\u0BC8\u0B9A\u0BCD \u0B9A\u0BC1\u0BB1\u0BCD\u0BB1\u0BBF \u0BAE\u0BC7\u0BB1\u0BCD\u0B95\u0BCB\u0BB3\u0BCD\u0B95\u0BB3\u0BCD \u0BA4\u0BC7\u0BB5\u0BC8 \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8 \u0BA8\u0BBF\u0BA9\u0BC8\u0BB5\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0BB3\u0BCD\u0B95.
str_unicode=S \u0B87\u0BA9\u0BCD \u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0B95\u0BA4\u0BBE\u0BAA\u0BBE\u0BA4\u0BCD\u0BA4\u0BBF\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B85\u0BB5\u0BB1\u0BCD\u0BB1\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0BB4\u0BC1 \u0BAF\u0BC2\u0BA9\u0BBF\u0B95\u0BCB\u0B9F\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB2\u0BCD \u0BB5\u0BBF\u0BB5\u0BB0\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
str_unicode_type=S \u0B87\u0BA9\u0BCD \u0B92\u0BB5\u0BCD\u0BB5\u0BCA\u0BB0\u0BC1 \u0BA4\u0BA9\u0BCD\u0BAE\u0BC8\u0BAF\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B85\u0BB5\u0BB1\u0BCD\u0BB1\u0BBF\u0BA9\u0BCD \u0BAF\u0BC2\u0BA9\u0BBF\u0B95\u0BCB\u0B9F\u0BCD \u0BB5\u0B95\u0BC8\u0BAF\u0BBE\u0BB2\u0BCD \u0BB5\u0BBF\u0BB5\u0BB0\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
xml_innerxml=\u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0B89\u0BB3\u0BCD \u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BA8\u0BC0\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4 \u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B89\u0BB0\u0BC8\u0BAF\u0BC8 \u0BA8\u0BC7\u0BB0\u0B9F\u0BBF\u0BAF\u0BBE\u0B95 \u0BA4\u0BBF\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA4\u0BCD \u0BA4\u0BB0\u0BBE\u0BA4\u0BC1 - \u0B85\u0BA4\u0BA9\u0BCD \u0B95\u0BC1\u0BB4\u0BA8\u0BCD\u0BA4\u0BC8\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0B89\u0BB3\u0BCD\u0BB3\u0B9F\u0B95\u0BCD\u0B95\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0BAE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BC7. Parsexml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95 () \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
xml_owntext=\u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B8E\u0B9A\u0BCD.\u0B9F\u0BBF.\u0B8E\u0BAE\u0BCD.\u0B8E\u0BB2\u0BCD \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0BAE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BC7 \u0B89\u0BB0\u0BC8\u0BAF\u0BC8 \u0BA8\u0BC7\u0BB0\u0B9F\u0BBF\u0BAF\u0BBE\u0B95 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B95\u0BC1\u0BB4\u0BA8\u0BCD\u0BA4\u0BC8\u0B95\u0BB3\u0BCD \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B89\u0BB0\u0BC8\u0BAF\u0BC8 \u0BAA\u0BC1\u0BB1\u0B95\u0BCD\u0B95\u0BA3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 (\u0B87\u0BA4\u0BB1\u0BCD\u0B95\u0BBE\u0B95, \u0B87\u0BA9\u0BCD\u0BA9\u0BB0\u0BCD\u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD () \u0B90\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD). \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95 \u0B92\u0BB0\u0BC1 \u0BAA\u0BBE\u0B95\u0BC1\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF\u0BAF\u0BC1\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD.
xml_parent=\u0BAA\u0BC6\u0BB1\u0BCD\u0BB1\u0BCB\u0BB0\u0BCD \u0B87\u0BB2\u0BCD\u0BB2\u0BBE\u0BB5\u0BBF\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD \u0BAA\u0BC6\u0BB1\u0BCD\u0BB1\u0BCB\u0BB0\u0BCD \u0BAE\u0BC1\u0BA9\u0BC8 \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BAA\u0BC2\u0B9A\u0BCD\u0BAF\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. Parsehtml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95 () \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
xml_parsexml=\u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B89\u0BB0\u0BC8 \u0BA8\u0BBF\u0BB1\u0BC8\u0BA8\u0BCD\u0BA4 \u0B95\u0BB2\u0BA4\u0BCD\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, PARSEXML () \u0B92\u0BB0\u0BC1 \u0BAE\u0BC1\u0BB4\u0BC1 \u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B86\u0BB5\u0BA3\u0BA4\u0BCD\u0BA4\u0BC8 \u0B85\u0BB3\u0BBF\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B95\u0BBE\u0BA3\u0BBE\u0BAE\u0BB2\u0BCD \u0BAA\u0BCB\u0BA9 \u0B8E\u0BA8\u0BCD\u0BA4 \u0B87\u0BB1\u0BC1\u0BA4\u0BBF \u0B95\u0BC1\u0BB1\u0BBF\u0B9A\u0BCD\u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0B9A\u0BC7\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
xml_scripttext=\u0B92\u0BB0\u0BC1 HTML/XML \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0B92\u0BB0\u0BC1\u0B99\u0BCD\u0B95\u0BBF\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4 \u0BA4\u0BB0\u0BB5\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BA4\u0BB0\u0BB5\u0BC1 \u0B8E.\u0B95\u0BBE. A & lt; \u0B9A\u0BCD\u0B95\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0B9F\u0BCD & gt; \u0B95\u0BC1\u0BB1\u0BBF\u0B9A\u0BCD\u0B9A\u0BCA\u0BB2\u0BCD.\n \u0BA4\u0BB0\u0BB5\u0BC1 \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0B89\u0BB0\u0BC8 \u0B85\u0BB2\u0BCD\u0BB2 \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8 \u0BA8\u0BBF\u0BA9\u0BC8\u0BB5\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0BB3\u0BCD\u0B95.\n \u0B92\u0BB0\u0BC1 \u0BAA\u0BAF\u0BA9\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BA4\u0BCD \u0BA4\u0BC6\u0BB0\u0BBF\u0BAF\u0BC1\u0BAE\u0BCD \u0B89\u0BB0\u0BC8\u0BAF\u0BC8\u0BAA\u0BCD \u0BAA\u0BC6\u0BB1 HTMLText () \u0B90\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD, & lt; \u0B9A\u0BCD\u0B95\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0B9F\u0BCD & gt ;, & lt; \u0B9A\u0BC2\u0BB2\u0BCD \u0BA4\u0BA3\u0BCD\u0B9F\u0BC1 & gt ;, \u0BAA\u0BCB\u0BA9\u0BCD\u0BB1\u0BB5\u0BB1\u0BCD\u0BB1\u0BBF\u0BA9\u0BCD \u0B89\u0BB3\u0BCD\u0BB3\u0B9F\u0B95\u0BCD\u0B95\u0B99\u0BCD\u0B95\u0BB3\u0BC1\u0B95\u0BCD\u0B95\u0BC1 \u0B9A\u0BCD\u0B95\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0B9F\u0BCD \u0B9F\u0BC6\u0B95\u0BCD\u0B9A\u0BCD\u0B9F\u0BCD ()\n Parsehtml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B9A\u0BCD\u0B95\u0BBF\u0BB0\u0BBF\u0BAA\u0BCD\u0B9F\u0BCD \u0B9F\u0BC6\u0B95\u0BCD\u0B9A\u0BCD\u0B9F\u0BCD () \u0B90\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD () \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
xml_selectxml=\u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1 \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0B8E\u0B95\u0BCD\u0B9A\u0BCD\u0B8E\u0BAE\u0BCD\u0B8E\u0BB2\u0BCD \u0B86\u0BB5\u0BA3\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BB5\u0BBF\u0BB0\u0BC1\u0BAE\u0BCD\u0BAA\u0BBF\u0BAF \u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. JSOUP \u0BA4\u0BC7\u0BB0\u0BCD\u0BB5\u0BBE\u0BB3\u0BB0\u0BCD \u0BA4\u0BCA\u0B9F\u0BB0\u0BBF\u0BAF\u0BB2\u0BCD: https://jsoup.org/apidocs/org/jsoup/select/selector.html \u0B90\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BCD \u0B85\u0B9F\u0BC8\u0BAF\u0BBE\u0BB3\u0BAE\u0BCD \u0B95\u0BBE\u0BA3\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9.
xml_wholetext=\u0B8E\u0BA8\u0BCD\u0BA4\u0BB5\u0BCA\u0BB0\u0BC1 \u0BAA\u0BC1\u0BA4\u0BBF\u0BAF \u0B95\u0BCB\u0B9F\u0BC1\u0B95\u0BB3\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B87\u0B9F\u0BC8\u0BB5\u0BC6\u0BB3\u0BBF\u0B95\u0BB3\u0BCD \u0B89\u0B9F\u0BCD\u0BAA\u0B9F \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1 \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B85\u0BA4\u0BA9\u0BCD \u0B95\u0BC1\u0BB4\u0BA8\u0BCD\u0BA4\u0BC8\u0B95\u0BB3\u0BBF\u0BA9\u0BCD (\u0B87\u0BA3\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BBE\u0BA4) \u0B89\u0BB0\u0BC8\u0BAF\u0BC8\u0BA4\u0BCD \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1, \u0BB5\u0B95\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BAA\u0BCD\u0BAA\u0B9F\u0BBE\u0BA4, \u0B87\u0BAF\u0BB2\u0BCD\u0BAA\u0BB1\u0BCD\u0BB1 \u0B89\u0BB0\u0BC8\u0BAF\u0BBF\u0BA9\u0BCD \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. Parsehtml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95 () \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
xml_xmltext=\u0B89\u0BB0\u0BC8\u0BAF\u0BBF\u0BA9\u0BCD \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0B92\u0BB0\u0BC1 \u0B89\u0B89\u0B95\u0BC1\u0BAE\u0BCA \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 \u0BA8\u0BC0\u0B95\u0BC1\u0BAE\u0BCA \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB3\u0BCD \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 (\u0B85\u0BA9\u0BC8\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC1\u0BB4\u0BA8\u0BCD\u0BA4\u0BC8 \u0B95\u0BC2\u0BB1\u0BC1\u0B95\u0BB3\u0BC1\u0BAE\u0BCD \u0B89\u0B9F\u0BCD\u0BAA\u0B9F) \u0BA4\u0BB0\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0B95\u0BC1\u0BB1\u0BBF\u0B9A\u0BCD\u0B9A\u0BCA\u0BB1\u0BCD\u0B95\u0BB3\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B89\u0BB3\u0BCD\u0BB3\u0BC7 \u0BB5\u0BB0\u0BBF \u0B87\u0B9F\u0BC8\u0BB5\u0BC6\u0BB3\u0BBF\u0B95\u0BB3\u0BC8 \u0BA8\u0BC0\u0B95\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. Parsehtml () \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 parsexml () \u0B89\u0B9F\u0BA9\u0BCD \u0B87\u0BA3\u0BC8\u0BA8\u0BCD\u0BA4\u0BC1 \u0B87\u0BA4\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BC1\u0BAE\u0BCD \u0BAE\u0BB1\u0BCD\u0BB1\u0BC1\u0BAE\u0BCD \u0B92\u0BB0\u0BC1 \u0B89\u0BB1\u0BC1\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95 () \u0BA4\u0BC7\u0BB0\u0BCD\u0BA8\u0BCD\u0BA4\u0BC6\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
fun_coalesce=\u0BA4\u0BCA\u0B9F\u0BB0\u0BCD\u0B9A\u0BCD\u0B9A\u0BBF\u0BAF\u0BBE\u0BA9 \u0BAA\u0BCA\u0BB0\u0BC1\u0BB3\u0BCD\u0B95\u0BB3\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0BAA\u0BC2\u0B9E\u0BCD\u0B9A\u0BC8 \u0B85\u0BB2\u0BCD\u0BB2\u0BBE\u0BA4\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1 (\u0B85\u0BA4\u0BBE\u0BB5\u0BA4\u0BC1 \u0B8E\u0BA8\u0BCD\u0BA4 \u0BA4\u0BB0\u0BB5\u0BC1 \u0BB5\u0B95\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD - \u0B9A\u0BB0\u0BAE\u0BCD, \u0BA4\u0BC7\u0BA4\u0BBF, \u0B8E\u0BA3\u0BCD, \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD \u0BAA\u0BCB\u0BA9\u0BCD\u0BB1\u0BB5\u0BC8).
fun_cross=\u0B87\u0BB2\u0B95\u0BCD\u0B95\u0BC1 \u0BA4\u0BBF\u0B9F\u0BCD\u0B9F\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B87\u0BB2\u0B95\u0BCD\u0B95\u0BC1 \u0BA8\u0BC6\u0B9F\u0BC1\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC8\u0BAA\u0BCD \u0BAA\u0BBE\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BBF\u0BB1\u0BA4\u0BC1, \u0BAA\u0BCA\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBF\u0BAF \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BC1 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1\u0B95\u0BB3\u0BCD \u0B92\u0BB0\u0BC7 \u0B9A\u0BB0\u0BAE\u0BCD \u0BAA\u0BBF\u0BB0\u0BA4\u0BBF\u0BA8\u0BBF\u0BA4\u0BBF\u0BA4\u0BCD\u0BA4\u0BC1\u0BB5\u0BA4\u0BCD\u0BA4\u0BC8\u0B95\u0BCD \u0B95\u0BCA\u0BA3\u0BCD\u0B9F\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD \u0BAE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BC7 \u0BAA\u0BCA\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9. \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B89\u0BB0\u0BC8\u0BAF\u0BBE\u0B9F\u0BB2\u0BCD \u0B9A\u0BC6\u0BB2\u0BCD \u0B8E\u0BA9 \u0BB5\u0BBF\u0BB3\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BAE\u0BCD. \u0B95\u0BB2\u0BA4\u0BCD\u0BA4\u0BBF\u0BB1\u0BCD\u0B95\u0BC1 \u0B85\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1. \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BBE\u0BB5\u0BA4\u0BC1 \u0B89\u0BB0\u0BC8\u0BAF\u0BBE\u0B9F\u0BB2\u0BCD \u0BA4\u0BB5\u0BBF\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 "" \u0B8E\u0BA9 \u0B85\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD \u0BA4\u0BB1\u0BCD\u0BAA\u0BCB\u0BA4\u0BC8\u0BAF \u0BA4\u0BBF\u0B9F\u0BCD\u0B9F\u0BAA\u0BCD \u0BAA\u0BC6\u0BAF\u0BB0\u0BBE\u0B95 \u0BB5\u0BBF\u0BB3\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BAE\u0BCD. \u0BAE\u0BC2\u0BA9\u0BCD\u0BB1\u0BBE\u0BB5\u0BA4\u0BC1 \u0B89\u0BB0\u0BC8\u0BAF\u0BBE\u0B9F\u0BB2\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BBE\u0B95 \u0BB5\u0BBF\u0BB3\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BAE\u0BCD (0 \u0B87\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1) \u0BA4\u0BB5\u0BBF\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD \u0B85\u0BB2\u0BCD\u0BB2\u0BA4\u0BC1 "" \u0B8E\u0BA9 \u0B85\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD.
fun_facet_count=\u0BA8\u0BC6\u0B9F\u0BC1\u0BB5\u0BB0\u0BBF\u0B9A\u0BC8 \u0BAA\u0BC6\u0BAF\u0BB0\u0BBF\u0BB2\u0BCD \u0B89\u0BB3\u0BCD\u0BB3 \u0B9A\u0BBE\u0BAF\u0BCD\u0B9A\u0BCD \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BBF\u0BB2\u0BCD \u0B89\u0BB3\u0BCD\u0BB3 \u0B83\u0BAA\u0BC7\u0B9A\u0BCD\u0B9F\u0BC6\u0B95\u0BCD\u0B9A\u0BCD\u0BAA\u0BBF\u0BB0\u0B9A\u0BA9\u0BC8\u0BA4\u0BCD \u0BA4\u0BC7\u0B9F\u0BC1\u0BB5\u0BA4\u0BA9\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD, \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BA4\u0BC7\u0BB0\u0BCD\u0BB5\u0BC1 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1\u0B9F\u0BA9\u0BCD \u0BA4\u0BCA\u0B9F\u0BB0\u0BCD\u0BAA\u0BC1\u0B9F\u0BC8\u0BAF \u0BAE\u0BC1\u0B95 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0B95\u0BCD\u0B95\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1.
fun_slice=\u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD, \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB1\u0BBF \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BBF, \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BB1\u0BBF \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BBF \u0BAE\u0BC2\u0BB2\u0B95\u0BCD\u0B95\u0BC2\u0BB1\u0BC1 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B89\u0BB0\u0BC8\u0BAF\u0BBE\u0B9F\u0BB2\u0BCD \u0BA4\u0BB5\u0BBF\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD, \u0B95\u0BB3\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0BBF\u0BB2\u0BCD \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BBF\u0B9F\u0BC1\u0BAE\u0BCD. \u0B8E\u0BB4\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BC1\u0B95\u0BB3\u0BCD \u0BAA\u0BC2\u0B9A\u0BCD\u0B9A\u0BBF\u0BAF\u0BA4\u0BCD\u0BA4\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BA4\u0BCA\u0B9F\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BA9\u0BCD\u0BB1\u0BA9 \u0B8E\u0BA9\u0BCD\u0BAA\u0BA4\u0BC8 \u0BA8\u0BBF\u0BA9\u0BC8\u0BB5\u0BBF\u0BB2\u0BCD \u0B95\u0BCA\u0BB3\u0BCD\u0B95. \u0B92\u0BB0\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8\u0BAA\u0BCD \u0BAA\u0BCA\u0BB1\u0BC1\u0BA4\u0BCD\u0BA4\u0BB5\u0BB0\u0BC8, \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAE\u0BC1\u0BA4\u0BB2\u0BCD \u0B95\u0BC1\u0BB1\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0BB2\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BC1 \u0B92\u0BB0\u0BC1 \u0BA4\u0BC1\u0BA3\u0BC8 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B9F\u0BC1 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0BA4\u0BB5\u0BBF\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBE\u0BB2\u0BCD, \u0B85\u0BA4\u0BC1 \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAF\u0BBF\u0BA9\u0BCD \u0BAE\u0BC1\u0B9F\u0BBF\u0BB5\u0BBE\u0B95 \u0BAA\u0BC1\u0BB0\u0BBF\u0BA8\u0BCD\u0BA4\u0BC1 \u0B95\u0BCA\u0BB3\u0BCD\u0BB3\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BA4\u0BC1\u0BA3\u0BCD\u0B9F\u0BC1 \u0BAE\u0B9F\u0BCD\u0B9F\u0BC1\u0BAE\u0BC7.
fun_time_since_unix_epoch_to_date=\u0BAF\u0BC1\u0BA9\u0BBF\u0B95\u0BCD\u0B9A\u0BCD \u0B9A\u0B95\u0BBE\u0BAA\u0BCD\u0BA4 \u0BA8\u0BC7\u0BB0\u0BA4\u0BCD\u0BA4\u0BBF\u0BA9\u0BCD \u0B85\u0B9F\u0BBF\u0BAA\u0BCD\u0BAA\u0B9F\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0B92\u0BB0\u0BC1 \u0BA4\u0BC7\u0BA4\u0BBF\u0BAF\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B8E\u0BA3\u0BCD\u0BA3\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0B87\u0BA8\u0BCD\u0BA4 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBF\u0B95\u0BCD\u0B95\u0BC8 \u0BAA\u0BBF\u0BA9\u0BCD\u0BB5\u0BB0\u0BC1\u0BAE\u0BCD \u0B89\u0BA4\u0BB5\u0BBF \u0B85\u0BB2\u0B95\u0BC1\u0B95\u0BB3\u0BBF\u0BB2\u0BCD \u0B92\u0BA9\u0BCD\u0BB1\u0BBF\u0BB2\u0BCD \u0BAF\u0BC1\u0BA9\u0BBF\u0B95\u0BCD\u0B9A\u0BCD \u0B9A\u0B95\u0BBE\u0BAA\u0BCD\u0BA4 \u0BA8\u0BC7\u0BB0\u0BAE\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0B95\u0BCD\u0B95\u0BB2\u0BBE\u0BAE\u0BCD: \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BBE\u0BB5\u0BA4\u0BC1, \u0BAE\u0BBF\u0BB2\u0BCD\u0BB2\u0BBF \u0BA8\u0BCA\u0B9F\u0BBF, \u0BAE\u0BC8\u0B95\u0BCD\u0BB0\u0BCB \u0B9A\u0BC6\u0B95\u0BA3\u0BCD\u0B9F\u0BCD. \u0B87\u0BAF\u0BB2\u0BCD\u0BAA\u0BC1\u0BA8\u0BBF\u0BB2\u0BC8 '' \u0B87\u0BB0\u0BA3\u0BCD\u0B9F\u0BBE\u0BB5\u0BA4\u0BC1 ''.
fun_to_number=\u0B8E\u0BA3\u0BCD\u0BA3\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BA4\u0BCD\u0BA4\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BAE\u0BB1\u0BCD\u0BB1 \u0BB5\u0B9F\u0BBF\u0BB5\u0B99\u0BCD\u0B95\u0BB3\u0BC8 \u0B92\u0BB0\u0BC1 \u0B9A\u0BB0\u0BAE\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1 \u0BAE\u0BC1\u0BAF\u0BB1\u0BCD\u0B9A\u0BBF\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD, \u0BAA\u0BBF\u0BA9\u0BCD\u0BA9\u0BB0\u0BCD \u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBE\u0B95. \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0B8F\u0BB1\u0BCD\u0B95\u0BA9\u0BB5\u0BC7 \u0B92\u0BB0\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BBE\u0B95 \u0B87\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD, \u0B85\u0BA4\u0BC1 \u0B8E\u0BA3\u0BCD\u0BA3\u0BC8\u0BA4\u0BCD \u0BA4\u0BB0\u0BC1\u0BAE\u0BCD.
fun_to_string=\u0B8E\u0BA8\u0BCD\u0BA4 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC1 \u0BB5\u0B95\u0BC8\u0BAF\u0BC8\u0BAF\u0BC1\u0BAE\u0BCD (\u0B9A\u0BB0\u0BAE\u0BCD, \u0B8E\u0BA3\u0BCD, \u0BA4\u0BC7\u0BA4\u0BBF, \u0BAA\u0BC2\u0BB2\u0BBF\u0BAF\u0BA9\u0BCD, \u0BAA\u0BBF\u0BB4\u0BC8, \u0BAA\u0BC2\u0B9A\u0BCD\u0BAF\u0BAE\u0BBE\u0BA9\u0BA4\u0BC1) \u0B8E\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1 \u0B85\u0BA8\u0BCD\u0BA4 \u0BAE\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BBF\u0BA9\u0BCD \u0B9A\u0BB0\u0BAE\u0BCD \u0BAA\u0BA4\u0BBF\u0BAA\u0BCD\u0BAA\u0BC8\u0B95\u0BCD \u0B95\u0BCA\u0B9F\u0BC1\u0B95\u0BCD\u0B95\u0BC1\u0BAE\u0BCD. \u0BB5\u0BBF\u0BB0\u0BC1\u0BAA\u0BCD\u0BAA\u0BAE\u0BBE\u0BA9 \u0B9A\u0BB0\u0BAE\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BC8\u0BAA\u0BCD\u0BAA\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0B8E\u0BA3\u0BCD\u0B95\u0BB3\u0BC8 \u0BB0\u0BB5\u0BC1\u0BA3\u0BCD\u0B9F\u0BBF\u0B99\u0BCD \u0BAE\u0BC2\u0BB2\u0BAE\u0BCD \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BB2\u0BBE\u0BAE\u0BCD. Https://docs.oracle.com/javase/8/docs/api/java/util/formatter.html \u0B90\u0BAA\u0BCD \u0BAA\u0BBE\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD. \u0BA4\u0BC7\u0BA4\u0BBF \u0BAA\u0BBE\u0B95\u0BC1\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BC1\u0BAE\u0BCD \u0BA4\u0BCA\u0B9F\u0BB0\u0BBF\u0BAF\u0BB2\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0BA4\u0BC7\u0BA4\u0BBF\u0B95\u0BB3\u0BC8 \u0B9A\u0BB0\u0B99\u0BCD\u0B95\u0BB3\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BB2\u0BBE\u0BAE\u0BCD. Https://openrefine.org/docs/manual/grelfunctions/#date- \u0B9A\u0BC6\u0BAF\u0BB2\u0BCD\u0BAA\u0BBE\u0B9F\u0BC1\u0B95\u0BB3\u0BC8\u0BAA\u0BCD \u0BAA\u0BBE\u0BB0\u0BCD\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD.
fun_to_date=\u0BA4\u0BC7\u0BA4\u0BBF \u0BAA\u0BCA\u0BB0\u0BC1\u0BB3\u0BBE\u0B95 \u0BAE\u0BBE\u0BB1\u0BCD\u0BB1\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0B89\u0BB3\u0BCD\u0BB3\u0BC0\u0B9F\u0BC1 \u0B9A\u0BC6\u0BAF\u0BCD\u0BAF\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAA\u0BCA\u0BB0\u0BC1\u0BB3\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BB5\u0BBE\u0BA4\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0B87\u0BB2\u0BCD\u0BB2\u0BBE\u0BAE\u0BB2\u0BCD, \u0B87\u0BA4\u0BC1 \u0B90\u0B8E\u0B9A\u0BCD\u0B93 8601 \u0BA8\u0BC0\u0B9F\u0BCD\u0B9F\u0BBF\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BC8\u0BAA\u0BCD\u0BAA\u0BC8 \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BC1\u0B95\u0BBF\u0BB1\u0BA4\u0BC1. \u0BB5\u0BBE\u0BA4\u0B99\u0BCD\u0B95\u0BB3\u0BC1\u0B9F\u0BA9\u0BCD, \u0BA8\u0BC0\u0B99\u0BCD\u0B95\u0BB3\u0BCD \u0BB5\u0BC6\u0BB3\u0BBF\u0BAF\u0BC0\u0B9F\u0BCD\u0B9F\u0BC1 \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BC8\u0BAA\u0BCD\u0BAA\u0BC8\u0B95\u0BCD \u0B95\u0B9F\u0BCD\u0B9F\u0BC1\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BB2\u0BBE\u0BAE\u0BCD. \u0BAE\u0BBE\u0BA4\u0BBE\u0BA8\u0BCD\u0BA4\u0BBF\u0BB0\u0BA4\u0BCD\u0BA4\u0BC1\u0B9F\u0BA9\u0BCD: \u0BAE\u0BBE\u0BA4\u0BA4\u0BCD\u0BA4\u0BBF\u0BB1\u0BCD\u0B95\u0BC1 \u0BAE\u0BC1\u0BA8\u0BCD\u0BA4\u0BC8\u0BAF \u0BA8\u0BBE\u0BB3\u0BCD \u0BA4\u0BC7\u0BA4\u0BBF \u0BB5\u0B9F\u0BBF\u0BB5\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F\u0BBF\u0BB0\u0BC1\u0BA8\u0BCD\u0BA4\u0BBE\u0BB2\u0BCD \u0BAA\u0BCA\u0BAF\u0BCD\u0BAF\u0BC8 \u0B85\u0BAE\u0BC8\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD. \u0BB5\u0B9F\u0BBF\u0BB5\u0BA4\u0BCD\u0BA4\u0BC1\u0B9F\u0BA9\u0BCD: \u0B9A\u0BBE\u0BA4\u0BCD\u0BA4\u0BBF\u0BAF\u0BAE\u0BBE\u0BA9 \u0BB5\u0B9F\u0BBF\u0BB5\u0B99\u0BCD\u0B95\u0BB3\u0BBF\u0BA9\u0BCD \u0BB5\u0BB0\u0BBF\u0B9A\u0BC8\u0BAA\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BAA\u0BCD\u0BAA\u0B9F\u0BCD\u0B9F \u0BAA\u0B9F\u0BCD\u0B9F\u0BBF\u0BAF\u0BB2\u0BC8\u0BAA\u0BCD \u0BAA\u0BAF\u0BA9\u0BCD\u0BAA\u0B9F\u0BC1\u0BA4\u0BCD\u0BA4\u0BBF \u0BA4\u0BC7\u0BA4\u0BBF\u0BAF\u0BC8 \u0B85\u0BB2\u0B9A \u0BAE\u0BC1\u0BAF\u0BB1\u0BCD\u0B9A\u0BBF\u0B95\u0BCD\u0B95\u0BB5\u0BC1\u0BAE\u0BCD. \u0B9A\u0BBF\u0BAE\u0BCD\u0BAA\u0BBF\u0BB3\u0BCD \u0BAA\u0BBF\u0BB3\u0BC6\u0B9F\u0BC7\u0B9F\u0BCD\u0B83\u0BAA\u0BBE\u0BB0\u0BCD\u0BAE\u0B9F\u0BCD \u0BA4\u0BCA\u0B9F\u0BB0\u0BBF\u0BAF\u0BB2\u0BCD \u0B85\u0B9F\u0BBF\u0BAA\u0BCD\u0BAA\u0B9F\u0BC8\u0BAF\u0BBF\u0BB2\u0BCD \u0BB5\u0BB4\u0B99\u0BCD\u0B95\u0BB2\u0BCD \u0BB5\u0B9F\u0BBF\u0BB5\u0B99\u0BCD\u0B95\u0BB3\u0BCD: <a href = "http://docs.oracle.com/javase/7/docs/api/java/text/simpledateformat.html"> \u0B8E\u0BB3\u0BBF\u0BAE\u0BC8\u0BAF\u0BBE\u0BA9\u0BA4\u0BC1.
