

# Functions
# 1. Arrays
arr_args_to_array=Vrac\u00ED v\u0161echny p\u0159edan\u00E9 argumenty jako pole
arr_in_array=Vrac\u00ED true, pokud pole obsahuje po\u017Eadovan\u00FD \u0159et\u011Bzec, a false v opa\u010Dn\u00E9m p\u0159\u00EDpad\u011B. Neprov\u00E1d\u00ED konverzi datov\u00FDch typ\u016F.
arr_join=Spoj\u00ED polo\u017Eky v poli pomoc\u00ED sep a vr\u00E1t\u00ED je v\u0161echny jako \u0159et\u011Bzec.
arr_reverse=Obr\u00E1t\u00ED pole a.
arr_sort=Se\u0159ad\u00ED pole vzestupn\u011B. P\u0159i \u0159azen\u00ED se rozli\u0161uj\u00ED velk\u00E1 a mal\u00E1 p\u00EDsmena.
arr_uniques=Vrac\u00ED pole s odstran\u011Bn\u00FDmi duplicitami. Rozli\u0161uje velk\u00E1 a mal\u00E1 p\u00EDsmena.
arr_zip=Slou\u010D\u00ED dv\u011B nebo v\u00EDce pol\u00ED do jedin\u00E9ho pole pol\u00ED, p\u0159i\u010Dem\u017E prvky se stejn\u00FDm indexem ze vstupn\u00EDch pol\u00ED se seskup\u00ED a vytvo\u0159\u00ED d\u00EDl\u010D\u00ED pole ve v\u00FDstupn\u00EDm poli.
bool_or=Pou\u017E\u00EDv\u00E1 logick\u00FD oper\u00E1tor OR na dvou nebo v\u00EDce logick\u00FDch \u010D\u00EDslech k vytvo\u0159en\u00ED logick\u00E9ho \u010D\u00EDsla. Nap\u0159\u00EDklad (1 < 3).or(1 > 7) vr\u00E1t\u00ED true, proto\u017Ee alespo\u0148 jedna z podm\u00EDnek (prvn\u00ED) je pravdiv\u00E1.
bool_not=Pou\u017E\u00EDv\u00E1 logick\u00FD oper\u00E1tor NOT na logick\u00E9m prvku k v\u00FDstupu logick\u00E9ho prvku. Nap\u0159\u00EDklad not(1 > 7) vr\u00E1t\u00ED true, proto\u017Ee 1 > 7 je nepravda.
bool_xor=Pou\u017E\u00EDv\u00E1 logick\u00FD oper\u00E1tor XOR (exkluzivn\u00ED nebo) na dva nebo v\u00EDce logick\u00FDch symbol\u016F, \u010D\u00EDm\u017E vytvo\u0159\u00ED logick\u00FD symbol. Vyhodnot\u00ED v\u00EDce p\u0159\u00EDkaz\u016F a vr\u00E1t\u00ED true, pokud je pravdiv\u00FD pouze jeden z nich. Nap\u0159\u00EDklad (1 < 3).xor(1 < 7) vr\u00E1t\u00ED false, proto\u017Ee v\u00EDce ne\u017E jedna z podm\u00EDnek je pravdiv\u00E1.
date_inc=Vrac\u00ED datum zm\u011Bn\u011Bn\u00E9 o danou hodnotu v dan\u00E9 \u010Dasov\u00E9 jednotce v uvozovk\u00E1ch. Tabulku naleznete na adrese https://openrefine.org/docs/manual/grelfunctions/#incd-n-s-timeunit. V\u00FDchoz\u00ED jednotkou je ''hodina''. Kladn\u00E1 hodnota datum zv\u011Bt\u0161\u00ED a z\u00E1porn\u00E1 hodnota jej posune v \u010Dase zp\u011Bt.
math_abs=Vrac\u00ED absolutn\u00ED hodnotu \u010D\u00EDsla.
math_acos=Vrac\u00ED obloukov\u00FD kosinus \u00FAhlu v rozsahu 0 a\u017E PI.
math_asin=Vr\u00E1t\u00ED obloukov\u00FD sinus \u00FAhlu v rozsahu -PI/2 a\u017E PI/2.
math_atan=Vrac\u00ED obloukovou te\u010Dnu \u00FAhlu v rozsahu -PI/2 a\u017E PI/2.
math_atan2=P\u0159evede pravo\u00FAhl\u00E9 sou\u0159adnice (n1, n2) na pol\u00E1rn\u00ED (r, theta). Vrac\u00ED \u010D\u00EDslo theta.
math_ceil=Vrac\u00ED horn\u00ED hranici \u010D\u00EDsla.
math_combin=Vrac\u00ED po\u010Det kombinac\u00ED pro n2 prvk\u016F rozd\u011Blen\u00FDch do n1.
math_cos=Vrac\u00ED trigonometrick\u00FD kosinus \u00FAhlu.
math_cosh=Vrac\u00ED hyperbolick\u00FD kosinus hodnoty.
math_degrees=P\u0159ev\u00E1d\u00ED \u00FAhel z radi\u00E1n\u016F na stupn\u011B.
math_even=Zaokrouhl\u00ED \u010D\u00EDslo nahoru na nejbli\u017E\u0161\u00ED sud\u00E9 cel\u00E9 \u010D\u00EDslo.
math_exp=Vrac\u00ED e na mocninu n.
math_fact=Vr\u00E1t\u00ED faktori\u00E1l \u010D\u00EDsla po\u010D\u00EDnaje 1.
math_factn=Vrac\u00ED faktori\u00E1l \u010D\u00EDsla n1, po\u010D\u00EDnaje \u010D\u00EDslem n2.
math_floor=Vrac\u00ED doln\u00ED hranici \u010D\u00EDsla.
math_gcd=Vr\u00E1t\u00ED nejv\u011Bt\u0161\u00ED spole\u010Dn\u00FD jmenovatel dvou \u010D\u00EDsel.
math_lcm=Vr\u00E1t\u00ED nejv\u011Bt\u0161\u00ED spole\u010Dn\u00FD jmenovatel dvou \u010D\u00EDsel.
bool_and=Pou\u017E\u00EDv\u00E1 logick\u00FD oper\u00E1tor AND na dvou nebo v\u00EDce logick\u00FDch soustav\u00E1ch k vytvo\u0159en\u00ED logick\u00E9 hodnoty. Vyhodnot\u00ED v\u00EDce p\u0159\u00EDkaz\u016F na logick\u00E9 a vr\u00E1t\u00ED true, pokud jsou v\u0161echny p\u0159\u00EDkazy pravdiv\u00E9. Nap\u0159\u00EDklad (1 < 3).a(1 < 0) vr\u00E1t\u00ED nepravdu, proto\u017Ee jedna podm\u00EDnka je pravdiv\u00E1 a druh\u00E1 nepravdiv\u00E1.
date_part=Vr\u00E1t\u00ED \u010D\u00E1st datumu. Vr\u00E1cen\u00FD typ dat z\u00E1vis\u00ED na jednotce. Tabulku naleznete na https://openrefine.org/docs/manual/grelfunctions/#datepartd-s-timeunit, https://openrefine.org/docs/manual/grelfunctions#date-functions.
date_now=Vr\u00E1t\u00ED aktu\u00E1ln\u00ED \u010Das podle syst\u00E9mov\u00FDch hodin v roz\u0161\u00ED\u0159en\u00E9m form\u00E1tu ISO 8601 (p\u0159evedeno na UTC). Nap\u0159\u00EDklad 10:53 (a 00 sekund) 26. listopadu 2020 v EST vr\u00E1t\u00ED [date 2020-11-26T15:53:00Z].
html_inner_html=Vrac\u00ED vnit\u0159n\u00ED HTML prvek HTML. Zahrnuje text a pod\u0159\u00EDzen\u00E9 prvky uvnit\u0159 vybran\u00E9ho prvku. Pou\u017Eijte jej ve spojen\u00ED s parseHtml() a select() pro poskytnut\u00ED prvku.
html_parse_html=P\u0159i zad\u00E1n\u00ED bu\u0148ky pln\u00E9 textu ve form\u00E1tu HTML funkce parseHtml() zjednodu\u0161\u00ED zna\u010Dky HTML (nap\u0159\u00EDklad odstran\u011Bn\u00EDm '' /'' na konci samouzav\u00EDrac\u00EDch zna\u010Dek), uzav\u0159e v\u0161echny neuzav\u0159en\u00E9 zna\u010Dky a vlo\u017E\u00ED zalomen\u00ED \u0159\u00E1dk\u016F a odr\u00E1\u017Eky, aby byl k\u00F3d \u010Dist\u0161\u00ED. Do bu\u0148ky nelze ulo\u017Eit v\u00FDstup funkce parseHtml(), pokud jej nep\u0159evedete pomoc\u00ED funkce toString(): nap\u0159\u00EDklad value.parseHtml().toString().
